[
    {
        "title": "US investigators are using AI to detect child abuse images made by AI",
        "link": "https://www.technologyreview.com/2025/09/26/1124343/us-investigators-are-using-ai-to-detect-child-abuse-images-made-by-ai/",
        "published": "Fri, 26 Sep 2025 19:03",
        "summary": "Generative AI has enabled the production of child sexual abuse images to skyrocket. Now the leading investigator of child exploitation in the US is experimenting with using AI to distinguish AI-generated images from material depicting real victims, according to a new government filing. The Department of Homeland Security’s Cyber Crimes Center, which investigates child exploitation&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Shoplifters could soon be chased down by drones",
        "link": "https://www.technologyreview.com/2025/09/25/1124088/shoplifters-could-soon-be-chased-down-by-drones/",
        "published": "Thu, 25 Sep 2025 17:34",
        "summary": "Flock Safety, whose drones were once reserved for police departments, is now offering them for private-sector security, the company announced today, with potential customers including businesses intent on curbing shoplifting.  Companies in the US can now place Flock’s drone docking stations on their premises. If the company has a waiver from the Federal Aviation Administration&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Gemini Robotics 1.5 brings AI agents into the physical world",
        "link": "https://deepmind.google/discover/blog/gemini-robotics-15-brings-ai-agents-into-the-physical-world/",
        "published": "Thu, 25 Sep 2025 15:59",
        "summary": "New era of physical agents will help robots perceive, plan, think, use tools and act to solve complex tasks.",
        "source": "DeepMind"
    },
    {
        "title": "What It's Like to Work at the White House",
        "link": "https://www.hyperdimensional.co/p/what-its-like-to-work-at-the-white",
        "published": "Thu, 25 Sep 2025 15:54",
        "summary": "Some reflections",
        "source": "Hyperdimensional"
    },
    {
        "title": "How AI and Wikipedia have sent vulnerable languages into a doom spiral",
        "link": "https://www.technologyreview.com/2025/09/25/1124005/ai-wikipedia-vulnerable-languages-doom-spiral/",
        "published": "Thu, 25 Sep 2025 09:00",
        "summary": "When Kenneth Wehr started managing the Greenlandic-language version of Wikipedia four years ago, his first act was to delete almost everything. It had to go, he thought, if it had any chance of surviving. Wehr, who’s 26, isn’t from Greenland—he grew up in Germany—but he had become obsessed with the island, an autonomous Danish territory,&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The AI Hype Index: Cracking the chatbot code",
        "link": "https://www.technologyreview.com/2025/09/24/1123999/the-ai-hype-index-cracking-the-chatbot-code/",
        "published": "Wed, 24 Sep 2025 09:40",
        "summary": "Separating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry. Millions of us use chatbots every day, even though we don’t really know how they work or how using them affects us. In&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "It’s surprisingly easy to stumble into a relationship with an AI chatbot",
        "link": "https://www.technologyreview.com/2025/09/24/1123915/relationship-ai-without-seeking-it/",
        "published": "Wed, 24 Sep 2025 09:00",
        "summary": "It’s a tale as old as time. Looking for help with her art project, she strikes up a conversation with her assistant. One thing leads to another, and suddenly she has a boyfriend she’s introducing to her friends and family. The twist? Her new companion is an AI chatbot.&#160; The first large-scale computational analysis of&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Thinking, Searching, and Acting",
        "link": "https://www.interconnects.ai/p/thinking-searching-and-acting",
        "published": "Mon, 22 Sep 2025 15:44",
        "summary": "A reflection on reasoning models.",
        "source": "Interconnects"
    },
    {
        "title": "Strengthening our Frontier Safety Framework",
        "link": "https://deepmind.google/discover/blog/strengthening-our-frontier-safety-framework/",
        "published": "Mon, 22 Sep 2025 13:09",
        "summary": "We’re strengthening the Frontier Safety Framework (FSF) to help identify and mitigate severe risks from advanced AI models.",
        "source": "DeepMind"
    }
]