[
    {
        "title": "The State of LLM Reasoning Models",
        "link": "https://magazine.sebastianraschka.com/p/state-of-llm-reasoning-and-inference-scaling",
        "published": "Sat, 08 Mar 2025 12:11",
        "summary": "Part 1: Inference-Time Compute Scaling Methods",
        "source": "Ahead of AI"
    },
    {
        "title": "On the US AI Safety Institute",
        "link": "https://www.hyperdimensional.co/p/on-the-us-ai-safety-institute",
        "published": "Thu, 06 Mar 2025 13:46",
        "summary": "And the role of evaluations in AI governance",
        "source": "Hyperdimensional"
    },
    {
        "title": "Where inference-time scaling pushes the market for AI companies",
        "link": "https://www.interconnects.ai/p/where-inference-time-scaling-pushes",
        "published": "Wed, 05 Mar 2025 13:01",
        "summary": "Fundamentals emerging downstream from the RL reasoning models.",
        "source": "Interconnects"
    },
    {
        "title": "AI reasoning models can cheat to win chess games",
        "link": "https://www.technologyreview.com/2025/03/05/1112819/ai-reasoning-models-can-cheat-to-win-chess-games/",
        "published": "Wed, 05 Mar 2025 10:00",
        "summary": "Facing defeat in chess, the latest generation of AI reasoning models sometimes cheat without being instructed to do so.&#160; The finding suggests that the next wave of AI models could be more likely to seek out deceptive ways of doing whatever they’ve been asked to do. And worst of all? There’s no simple way to&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Customizing generative AI for unique value",
        "link": "https://www.technologyreview.com/2025/03/04/1112197/customizing-generative-ai-for-unique-value/",
        "published": "Tue, 04 Mar 2025 16:00",
        "summary": "Since the emergence of enterprise-grade generative AI, organizations have tapped into the rich capabilities of foundational models, developed by the likes of OpenAI, Google DeepMind, Mistral, and others. Over time, however, businesses often found these models limiting since they were trained on vast troves of public data. Enter customization—the practice of adapting large language models&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Inside the Wild West of AI companionship",
        "link": "https://www.technologyreview.com/2025/03/04/1112768/inside-the-wild-west-of-ai-companionship/",
        "published": "Tue, 04 Mar 2025 10:00",
        "summary": "This story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here. Last week, I made a troubling discovery about an AI companion site called Botify AI: It was hosting sexually charged conversations with underage celebrity bots. These bots took on characters meant to&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "How DeepSeek became a fortune teller for China’s youth",
        "link": "https://www.technologyreview.com/2025/03/03/1112604/deepseek-fortune-teller-china/",
        "published": "Mon, 03 Mar 2025 08:55",
        "summary": "In the glow of her laptop screen, 31-year-old Zhang Rui typed carefully, following a prompt she’d found on Chinese social media: “You are a BaZi master. Analyze my fate—describe my physical traits, key life events, and financial fortune. I am a female, born June 17, 1993, at 4:42 a.m. in Hangzhou.” DeepSeek R1, China’s most&#8230;",
        "source": "Technology Review"
    }
]