[
    {
        "title": "Music AI Sandbox, now with new features and broader access",
        "link": "https://deepmind.google/discover/blog/music-ai-sandbox-now-with-new-features-and-broader-access/",
        "published": "Thu, 24 Apr 2025 15:01",
        "summary": "Helping music professionals explore the potential of generative AI",
        "source": "DeepMind"
    },
    {
        "title": "Seeing AI as a collaborator, not a creator",
        "link": "https://www.technologyreview.com/2025/04/23/1114891/editors-letter-creativity-art-ai-collaboration-humanity-technology/",
        "published": "Wed, 23 Apr 2025 09:00",
        "summary": "The reason you are reading this letter from me today is that I was bored 30 years ago.&#160; I was bored and curious about the world and so I wound up spending a lot of time in the university computer lab, screwing around on Usenet and the early World Wide Web, looking for interesting things&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The future of AI processing",
        "link": "https://www.technologyreview.com/2025/04/22/1114962/the-future-of-ai-processing/",
        "published": "Tue, 22 Apr 2025 13:30",
        "summary": "Artificial Intelligence (AI) is emerging in everyday use cases, thanks to advances in foundational models, more powerful chip technology, and abundant data. To become truly embedded and seamless, AI computation must now be distributed—and much of it will take place on device and at the edge.&#160; To support this evolution, computation for running AI workloads&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Generative AI is reshaping South Korea’s webcomics industry",
        "link": "https://www.technologyreview.com/2025/04/22/1114874/generative-ai-south-korea-webcomics/",
        "published": "Tue, 22 Apr 2025 09:00",
        "summary": "“My mind is still sharp and my hands work just fine, so I have no interest in getting help from AI to draw or write stories,” says Lee Hyun-se, a legendary South Korean cartoonist best known for his seminal series A Daunting Team, a 1983 manhwa about the coming-of-age of heroic underdog baseball players. “Still,&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The latest open artifacts (#9): RLHF book draft, where the open reasoning race is going, and unsung heroes of open LM work",
        "link": "https://www.interconnects.ai/p/the-latest-open-artifacts-9-rlhf",
        "published": "Mon, 21 Apr 2025 16:39",
        "summary": "Artifacts Log 9. ",
        "source": "Interconnects"
    },
    {
        "title": "AI is pushing the limits of the physical world",
        "link": "https://www.technologyreview.com/2025/04/21/1114764/ai-artificial-intelligence-architecture-building/",
        "published": "Mon, 21 Apr 2025 10:00",
        "summary": "Architecture often assumes a binary between built projects and theoretical ones. What physics allows in actual buildings, after all, is vastly different from what architects can imagine and design (often referred to as “paper architecture”). That imagination has long been supported and enabled by design technology, but the latest advancements in artificial intelligence have prompted&#8230;",
        "source": "Technology Review"
    }
]