[
    {
        "title": "What I've been reading (#1)",
        "link": "https://www.interconnects.ai/p/what-ive-been-reading-1",
        "published": "Sat, 21 Jun 2025 15:21",
        "summary": "Splitting the links out from the artifacts log models & datasets series.",
        "source": "Interconnects"
    },
    {
        "title": "It’s pretty easy to get DeepSeek to talk dirty",
        "link": "https://www.technologyreview.com/2025/06/19/1119066/ai-chatbot-dirty-talk-deepseek-replika/",
        "published": "Thu, 19 Jun 2025 15:08",
        "summary": "AI companions like Replika are designed to engage in intimate exchanges, but people use general-purpose chatbots for sex talk too, despite their stricter content moderation policies. Now new research shows that not all chatbots are equally willing to talk dirty: DeepSeek is the easiest to convince. But other AI chatbots can be enticed too, if&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "OpenAI can rehabilitate AI models that develop a “bad-boy persona”",
        "link": "https://www.technologyreview.com/2025/06/18/1119042/openai-can-rehabilitate-ai-models-that-develop-a-bad-boy-persona/",
        "published": "Wed, 18 Jun 2025 18:19",
        "summary": "A new paper from OpenAI has shown why a little bit of bad training can make AI models go rogue—but also demonstrates that this problem is generally pretty easy to fix.&#160; Back in February, a group of researchers discovered that fine-tuning an AI model (in their case, OpenAI’s GPT-4o) by training it on code that&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Crafting a good (reasoning) model",
        "link": "https://www.interconnects.ai/p/crafting-a-good-reasoning-model",
        "published": "Wed, 18 Jun 2025 13:05",
        "summary": "A recent talk I gave on model training, reasoning, and the next frontier.",
        "source": "Interconnects"
    },
    {
        "title": "Why AI hardware needs to be open",
        "link": "https://www.technologyreview.com/2025/06/18/1118943/ai-hardware-open/",
        "published": "Wed, 18 Jun 2025 08:49",
        "summary": "When OpenAI acquired Io to create “the coolest piece of tech that the world will have ever seen,” it confirmed what industry experts have long been saying: Hardware is the new frontier for AI. AI will no longer just be an abstract thing in the cloud far away. It’s coming for our homes, our rooms,&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Gemini 2.5: Updates to our family of thinking models",
        "link": "https://deepmind.google/discover/blog/gemini-25-updates-to-our-family-of-thinking-models/",
        "published": "Tue, 17 Jun 2025 16:03",
        "summary": "Explore the latest Gemini 2.5 model updates with enhanced performance and accuracy: Gemini 2.5 Pro now stable, Flash generally available, and the new Flash-Lite in preview.",
        "source": "DeepMind"
    },
    {
        "title": "We’re expanding our Gemini 2.5 family of models",
        "link": "https://deepmind.google/discover/blog/were-expanding-our-gemini-25-family-of-models/",
        "published": "Tue, 17 Jun 2025 16:01",
        "summary": "Gemini 2.5 Flash and Pro are now generally available, and we’re introducing 2.5 Flash-Lite, our most cost-efficient and fastest 2.5 model yet.",
        "source": "DeepMind"
    },
    {
        "title": "Understanding and Coding the KV Cache in LLMs from Scratch",
        "link": "https://magazine.sebastianraschka.com/p/coding-the-kv-cache-in-llms",
        "published": "Tue, 17 Jun 2025 10:55",
        "summary": "",
        "source": "Ahead of AI"
    },
    {
        "title": "AI copyright anxiety will hold back creativity",
        "link": "https://www.technologyreview.com/2025/06/17/1118898/ai-copyright-anxiety-will-hold-back-creativity/",
        "published": "Tue, 17 Jun 2025 10:00",
        "summary": "Last fall, while attending a board meeting in Amsterdam, I had a few free hours and made an impromptu visit to the Van Gogh Museum. I often steal time for visits like this—a perk of global business travel for which I am grateful. Wandering the galleries, I found myself before The Courtesan (after Eisen), painted&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "When AIs bargain, a less advanced agent could cost you",
        "link": "https://www.technologyreview.com/2025/06/17/1118910/ai-price-negotiation/",
        "published": "Tue, 17 Jun 2025 08:00",
        "summary": "The race to build ever larger AI models is slowing down. The industry’s focus is shifting toward agents—systems that can act autonomously, make decisions, and negotiate on users’ behalf. But what would happen if both a customer and a seller were using an AI agent? A recent study put agent-to-agent negotiations to the test and&#8230;",
        "source": "Technology Review"
    }
]