[
    {
        "title": "AI system predicts protein fragments that can bind to or inhibit a target",
        "link": "https://news.mit.edu/2025/ai-system-fragfold-predicts-protein-fragments-0220",
        "published": "Thu, 20 Feb 2025 14:35",
        "summary": "FragFold, developed by MIT Biology researchers, is a computational method with potential for impact on biological research and therapeutic applications.",
        "source": "MIT News"
    },
    {
        "title": "How Should AI Liability Work? (Part I)",
        "link": "https://www.hyperdimensional.co/p/how-should-ai-liability-work-part",
        "published": "Thu, 20 Feb 2025 13:35",
        "summary": "The “Race to The Top”",
        "source": "Hyperdimensional"
    },
    {
        "title": "The latest open artifacts (#7): Alpaca era of reasoning models, China's continued dominance, and tons of multimodal advancements",
        "link": "https://www.interconnects.ai/p/artifacts-7",
        "published": "Wed, 19 Feb 2025 19:03",
        "summary": "Artifacts Log 7. It'll continue to be a fun spring for AI researchers and practitioners.",
        "source": "Interconnects"
    },
    {
        "title": "Like human brains, large language models reason about diverse data in a general way",
        "link": "https://news.mit.edu/2025/large-language-models-reason-about-diverse-data-general-way-0219",
        "published": "Wed, 19 Feb 2025 00:00",
        "summary": "A new study shows LLMs represent different data types based on their underlying meaning and reason about data in their dominant language.",
        "source": "MIT News"
    },
    {
        "title": "MIT spinout maps the body’s metabolites to uncover the hidden drivers of disease",
        "link": "https://news.mit.edu/2025/mit-spinout-maps-body-metabolites-uncovering-hidden-disease-drivers-0219",
        "published": "Wed, 19 Feb 2025 00:00",
        "summary": "ReviveMed uses AI to gather large-scale data on metabolites — molecules like lipids, cholesterol, and sugar — to match patients with therapeutics.",
        "source": "MIT News"
    },
    {
        "title": "Grok 3 and an accelerating AI roadmap",
        "link": "https://www.interconnects.ai/p/grok-3-and-an-accelerating-ai-roadmap",
        "published": "Tue, 18 Feb 2025 20:20",
        "summary": "Where AI is heading, why 2024 felt slow, and shifting priorities of frontier laboratories.",
        "source": "Interconnects"
    },
    {
        "title": "Inside China’s electric-vehicle-to-humanoid-robot pivot",
        "link": "https://www.technologyreview.com/2025/02/18/1111964/inside-chinas-electric-vehicle-to-humanoid-robot-pivot/",
        "published": "Tue, 18 Feb 2025 10:00",
        "summary": "This story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here. While DOGE’s efforts to shutter federal agencies dominate news from Washington, the Trump administration is also making more global moves. Many of these center on China. Tariffs on goods from the country&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "This artist collaborates with AI and robots",
        "link": "https://www.technologyreview.com/2025/02/17/1111387/ai-sougwen-chung-art-robots-collaboration/",
        "published": "Mon, 17 Feb 2025 10:00",
        "summary": "Many artists worry about the encroachment of artificial intelligence on artistic creation. But Sougwen Chung, a nonbinary Canadian-Chinese artist, instead sees AI as an opportunity for artists to embrace uncertainty and challenge people to think about technology and creativity in unexpected ways.&#160; Chung’s exhibitions are driven by technology; they’re also live and kinetic, with the&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "China’s EV giants are betting big on humanoid robots",
        "link": "https://www.technologyreview.com/2025/02/14/1111920/chinas-electric-vehicle-giants-pivot-humanoid-robots/",
        "published": "Fri, 14 Feb 2025 09:08",
        "summary": "At the 2025 CCTV New Year Gala last month, a televised spectacle watched by over a billion viewers in China, 16 humanoid robots took the stage. Clad in vibrant floral print jackets, they took part in a signature element of northeastern China’s Yangko dance, twirling red handkerchiefs in unison with human dancers. But the robots&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "AI model deciphers the code in proteins that tells them where to go",
        "link": "https://news.mit.edu/2025/ai-model-deciphers-code-proteins-tells-them-where-to-go-0213",
        "published": "Thu, 13 Feb 2025 17:10",
        "summary": "Whitehead Institute and CSAIL researchers created a machine-learning model to predict and generate protein localization, with implications for understanding and remedying disease.",
        "source": "MIT News"
    },
    {
        "title": "Designing the future of entertainment",
        "link": "https://www.technologyreview.com/2025/02/13/1110420/designing-the-future-of-entertainment/",
        "published": "Thu, 13 Feb 2025 12:30",
        "summary": "An entertainment revolution, powered by AI and other emerging technologies, is fundamentally changing how content is created and consumed today. Media and entertainment (M&#38;E) brands are faced with unprecedented opportunities—to reimagine costly and complex production workloads, to predict the success of new scripts or outlines, and to deliver immersive entertainment in novel formats like virtual&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The AI relationship revolution is already here",
        "link": "https://www.technologyreview.com/2025/02/13/1111366/ai-relationships-chatbots-parenting-self-care-dating-marriage-mental-health/",
        "published": "Thu, 13 Feb 2025 09:46",
        "summary": "AI is everywhere, and it’s starting to alter our relationships in new and unexpected ways—relationships with our spouses, kids, colleagues, friends, and even ourselves. Although the technology remains unpredictable and sometimes baffling, individuals from all across the world and from all walks of life are finding it useful, supportive, and comforting, too. People are using&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Gift from Sebastian Man ’79, SM ’80 supports MIT Stephen A. Schwarzman College of Computing building",
        "link": "https://news.mit.edu/2025/gift-sebastian-man-supports-mit-stephen-schwarzman-college-computing-building-0211",
        "published": "Tue, 11 Feb 2025 15:45",
        "summary": "Alumnus is the first major donor to support the building since Stephen A. Schwarzman’s foundational gift.",
        "source": "MIT News"
    }
]