[
    {
        "title": "Latest open artifacts (#16): Who's building models in the U.S., China's model release playbook, and a resurgence of truly open models",
        "link": "https://www.interconnects.ai/p/latest-open-artifacts-16-whos-building",
        "published": "Sun, 23 Nov 2025 19:31",
        "summary": "A month with SOTA releases with (truly) open model releases left and right.",
        "source": "Interconnects"
    },
    {
        "title": "Artifacts of a Busy Week",
        "link": "https://www.hyperdimensional.co/p/artifacts-of-a-busy-week",
        "published": "Fri, 21 Nov 2025 15:15",
        "summary": "A debate on superintelligence, an essay on liability, and Congressional testimony ",
        "source": "Hyperdimensional"
    },
    {
        "title": "Designing digital resilience in the agentic AI era",
        "link": "https://www.technologyreview.com/2025/11/20/1127941/designing-digital-resilience-in-the-agentic-ai-era/",
        "published": "Thu, 20 Nov 2025 14:30",
        "summary": "Digital resilience—the ability to prevent, withstand, and recover from digital disruptions—has long been a strategic priority for enterprises. With the rise of agentic AI, the urgency for robust resilience is greater than ever. Agentic AI represents a new generation of autonomous systems capable of proactive planning, reasoning, and executing tasks with minimal human intervention. As&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Olmo 3: America’s truly open reasoning models",
        "link": "https://www.interconnects.ai/p/olmo-3-americas-truly-open-reasoning",
        "published": "Thu, 20 Nov 2025 14:09",
        "summary": "",
        "source": "Interconnects"
    },
    {
        "title": "Scaling innovation in manufacturing with AI",
        "link": "https://www.technologyreview.com/2025/11/19/1128067/scaling-innovation-in-manufacturing-with-ai/",
        "published": "Wed, 19 Nov 2025 16:54",
        "summary": "Manufacturing is getting a major system upgrade. As AI amplifies existing technologies—like digital twins, the cloud, edge computing, and the industrial internet of things (IIoT)—it is enabling factory operations teams to shift from reactive, isolated problem-solving to proactive, systemwide optimization. Digital twins—physically accurate virtual representations of a piece of equipment, a production line, a process,&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Quantum physicists have shrunk and “de-censored” DeepSeek R1",
        "link": "https://www.technologyreview.com/2025/11/19/1128119/quantum-physicists-compress-and-deconsor-deepseekr1/",
        "published": "Wed, 19 Nov 2025 10:00",
        "summary": "A group of quantum physicists claims to have created a version of the powerful reasoning AI model DeepSeek R1 that strips out the censorship built into the original by its Chinese creators.&#160; The scientists at Multiverse Computing, a Spanish firm specializing in quantum-inspired AI techniques, created DeepSeek R1 Slim, a model that is 55% smaller&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Networking for AI: Building the foundation for real-time intelligence",
        "link": "https://www.technologyreview.com/2025/11/18/1127997/networking-for-ai-building-the-foundation-for-real-time-intelligence/",
        "published": "Tue, 18 Nov 2025 16:03",
        "summary": "The Ryder Cup is an almost-century-old tournament pitting Europe against the United States in an elite showcase of golf skill and strategy. At the 2025 event, nearly a quarter of a million spectators gathered to watch three days of fierce competition on the fairways. From a technology and logistics perspective, pulling off an event of&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Realizing value with AI inference at scale and in production",
        "link": "https://www.technologyreview.com/2025/11/18/1128007/realizing-value-with-ai-inference-at-scale-and-in-production/",
        "published": "Tue, 18 Nov 2025 16:02",
        "summary": "Training an AI model to predict equipment failures is an engineering achievement. But it&#8217;s not until prediction meets action—the moment that model successfully flags a malfunctioning machine—that true business transformation occurs. One technical milestone lives in a proof-of-concept deck; the other meaningfully contributes to the bottom line. Craig Partridge, senior director worldwide of Digital Next&#8230;",
        "source": "Technology Review"
    }
]