[
    {
        "title": "Ilya on deep learning in 2015",
        "link": "https://www.interconnects.ai/p/ilya-on-deep-learning-in-2015",
        "published": "Sat, 28 Jun 2025 18:02",
        "summary": "On vision and how to understand deep learning.",
        "source": "Interconnects"
    },
    {
        "title": "Latest open artifacts (#11): Visualizing China's open models market share, Arcee's models, and VLAs for robotics",
        "link": "https://www.interconnects.ai/p/latest-open-artifacts-11-visualizing",
        "published": "Thu, 26 Jun 2025 14:19",
        "summary": "Artifacts Log 11. ",
        "source": "Interconnects"
    },
    {
        "title": "AlphaGenome: AI for better understanding the genome",
        "link": "https://deepmind.google/discover/blog/alphagenome-ai-for-better-understanding-the-genome/",
        "published": "Wed, 25 Jun 2025 13:59",
        "summary": "Introducing a new, unifying DNA sequence model that advances regulatory variant-effect prediction and promises to shed new light on genome function — now available via API.",
        "source": "DeepMind"
    },
    {
        "title": "The AI Hype Index: AI-powered toys are coming",
        "link": "https://www.technologyreview.com/2025/06/25/1119286/ai-hype-index-toys-agents-openai-yoshua-bengio/",
        "published": "Wed, 25 Jun 2025 09:44",
        "summary": "Separating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry. AI agents might be the toast of the AI industry, but they’re still not that reliable. That’s why Yoshua Bengio, one of the&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Gemini Robotics On-Device brings AI to local robotic devices",
        "link": "https://deepmind.google/discover/blog/gemini-robotics-on-device-brings-ai-to-local-robotic-devices/",
        "published": "Tue, 24 Jun 2025 14:00",
        "summary": "We’re introducing an efficient, on-device robotics model with general-purpose dexterity and fast task adaptation.",
        "source": "DeepMind"
    },
    {
        "title": "Can we fix AI’s evaluation crisis?",
        "link": "https://www.technologyreview.com/2025/06/24/1119187/fix-ai-evaluation-crisis/",
        "published": "Tue, 24 Jun 2025 08:50",
        "summary": "As a tech reporter I often get asked questions like “Is DeepSeek actually better than ChatGPT?” or “Is the Anthropic model any good?” If I don’t feel like turning it into an hour-long seminar, I’ll usually give the diplomatic answer: “They’re both solid in different ways.” Most people asking aren’t defining “good” in any precise&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "A Chinese firm has just launched a constantly changing set of AI benchmarks",
        "link": "https://www.technologyreview.com/2025/06/23/1119190/chinese-changing-ai-benchmarks/",
        "published": "Mon, 23 Jun 2025 15:46",
        "summary": "When testing an AI model, it’s hard to tell if it is reasoning or just regurgitating answers from its training data. Xbench, a new benchmark developed by the Chinese venture capital firm HSG, or HongShan Capital Group, might help to sidestep that issue. That’s thanks to the way it evaluates models not only on the&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Some ideas for what comes next",
        "link": "https://www.interconnects.ai/p/summertime-outlook-o3s-novelty-coming",
        "published": "Mon, 23 Jun 2025 13:30",
        "summary": "As releases slow down, it's time to think about what we got this year and where we are going. o3's search, agent vs model progress, and scaling's settling.",
        "source": "Interconnects"
    }
]