[
    {
        "title": "The American DeepSeek Project",
        "link": "https://www.interconnects.ai/p/the-american-deepseek-project",
        "published": "Fri, 04 Jul 2025 12:03",
        "summary": "What I think the next goal for the open-source AI community is.",
        "source": "Interconnects"
    },
    {
        "title": "Inside India’s scramble for AI independence",
        "link": "https://www.technologyreview.com/2025/07/04/1119705/inside-indias-scramble-for-ai-independence/",
        "published": "Fri, 04 Jul 2025 08:15",
        "summary": "In Bengaluru, India, Adithya Kolavi felt a mix of excitement and validation as he watched DeepSeek unleash its disruptive language model on the world earlier this year. The Chinese technology rivaled the best of the West in terms of benchmarks, but it had been built with far less capital in far less time.&#160; “I thought:&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Don’t let hype about AI agents get ahead of reality",
        "link": "https://www.technologyreview.com/2025/07/03/1119545/dont-let-hype-about-ai-agents-get-ahead-of-reality/",
        "published": "Thu, 03 Jul 2025 09:00",
        "summary": "Google’s recent unveiling of what it calls a “new class of agentic experiences” feels like a turning point. At its I/O 2025 event in May, for example, the company showed off a digital assistant that didn’t just answer questions; it helped work on a bicycle repair by finding a matching user manual, locating a YouTube&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "How generative AI could help make construction sites safer",
        "link": "https://www.technologyreview.com/2025/07/02/1119607/how-generative-ai-could-help-make-construction-sites-safer/",
        "published": "Wed, 02 Jul 2025 09:00",
        "summary": "Last winter, during the construction of an affordable housing project on Martha’s Vineyard, Massachusetts, a 32-year-old worker named Jose Luis Collaguazo Crespo slipped off a ladder on the second floor and plunged to his death in the basement. He was one of more than 1,000 construction workers who die on the job each year in the US, making&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "LLM Research Papers: The 2025 List (January to June)",
        "link": "https://magazine.sebastianraschka.com/p/llm-research-papers-2025-list-one",
        "published": "Tue, 01 Jul 2025 11:11",
        "summary": " A topic-organized collection of 200+ LLM research papers from 2025",
        "source": "Ahead of AI"
    },
    {
        "title": "Cloudflare will now, by default, block AI bots from crawling its clients’ websites",
        "link": "https://www.technologyreview.com/2025/07/01/1119498/cloudflare-will-now-by-default-block-ai-bots-from-crawling-its-clients-websites/",
        "published": "Tue, 01 Jul 2025 10:00",
        "summary": "The internet infrastructure company Cloudflare announced today that it will now default to blocking AI bots from visiting websites it hosts. Cloudflare will also give clients the ability to manually allow or ban these AI bots on a case-by-case basis, and it will introduce a so-called “pay-per-crawl” service that clients can use to receive compensation&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "People are using AI to ‘sit’ with them while they trip on psychedelics",
        "link": "https://www.technologyreview.com/2025/07/01/1119513/ai-sit-trip-psychedelics/",
        "published": "Tue, 01 Jul 2025 09:06",
        "summary": "Peter sat alone in his bedroom as the first waves of euphoria coursed through his body like an electrical current. He was in darkness, save for the soft blue light of the screen glowing from his lap. Then he started to feel pangs of panic. He picked up his phone and typed a message to&#8230;",
        "source": "Technology Review"
    }
]