[
    {
        "title": "The Big LLM Architecture Comparison",
        "link": "https://magazine.sebastianraschka.com/p/the-big-llm-architecture-comparison",
        "published": "Sat, 19 Jul 2025 11:11",
        "summary": "From DeepSeek-V3 to Kimi K2: A Look At Modern LLM Architecture Design",
        "source": "Ahead of AI"
    },
    {
        "title": "A major AI training data set contains millions of examples of personal data",
        "link": "https://www.technologyreview.com/2025/07/18/1120466/a-major-ai-training-data-set-contains-millions-of-examples-of-personal-data/",
        "published": "Fri, 18 Jul 2025 13:08",
        "summary": "Millions of images of passports, credit cards, birth certificates, and other documents containing personally identifiable information are likely included in one of the biggest open-source AI training sets, new research has found. Thousands of images—including identifiable faces—were found in a small subset of DataComp CommonPool, a major AI training set for image generation scraped from&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "How to run an LLM on your laptop",
        "link": "https://www.technologyreview.com/2025/07/17/1120391/how-to-run-an-llm-on-your-laptop/",
        "published": "Thu, 17 Jul 2025 17:01",
        "summary": "MIT Technology Review’s How To series helps you get things done.&#160; Simon Willison has a plan for the end of the world. It’s a USB stick, onto which he has loaded a couple of his favorite open-weight LLMs—models that have been shared publicly by their creators and that can, in principle, be downloaded and run&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "These four charts show where AI companies could go next in the US",
        "link": "https://www.technologyreview.com/2025/07/16/1120233/these-four-charts-show-where-ai-companies-could-go-next-in-the-us/",
        "published": "Wed, 16 Jul 2025 14:00",
        "summary": "No one knows exactly how AI will transform our communities, workplaces, and society as a whole. Because it’s hard to predict the impact AI will have on jobs, many workers and local governments are left trying to read the tea leaves to understand how to prepare and adapt. A new interactive report released today by&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Google’s generative video model Veo 3 has a subtitles problem",
        "link": "https://www.technologyreview.com/2025/07/15/1120156/googles-generative-video-model-veo-3-has-a-subtitles-problem/",
        "published": "Tue, 15 Jul 2025 14:40",
        "summary": "As soon as Google launched its latest video-generating AI model at the end of May, creatives rushed to put it through its paces. Released just months after its predecessor, Veo 3 allows users to generate sounds and dialogue for the first time, sparking a flurry of hyperrealistic eight-second clips stitched together into ads, ASMR videos,&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "AI text-to-speech programs could “unlearn” how to imitate certain people",
        "link": "https://www.technologyreview.com/2025/07/15/1120094/ai-text-to-speech-programs-could-one-day-unlearn/",
        "published": "Tue, 15 Jul 2025 10:00",
        "summary": "A technique known as “machine unlearning” could teach AI models to forget specific voices—an important step in stopping the rise of audio deepfakes, where someone’s voice is copied to carry out fraud or scams. Recent advances in artificial intelligence have revolutionized the quality of text-to-speech technology so that people can convincingly re-create a piece of&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Kimi K2 and when \"DeepSeek Moments\" become normal",
        "link": "https://www.interconnects.ai/p/kimi-k2-and-when-deepseek-moments",
        "published": "Mon, 14 Jul 2025 15:15",
        "summary": "One \"DeepSeek Moment\" wasn't enough for us to wake up, hopefully we don't need a third.",
        "source": "Interconnects"
    }
]