[
    {
        "title": "Inside the marketplace powering bespoke AI deepfakes of real women",
        "link": "https://www.technologyreview.com/2026/01/30/1131945/inside-the-marketplace-powering-bespoke-ai-deepfakes-of-real-women/",
        "published": "Fri, 30 Jan 2026 16:32",
        "summary": "Civitai—an online marketplace for buying and selling AI-generated content, backed by the venture capital firm Andreessen Horowitz—is letting users buy custom instruction files for generating celebrity deepfakes. Some of these files were specifically designed to make pornographic images banned by the site, a new analysis has found. The study, from researchers at Stanford and Indiana&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Thoughts on the job market in the age of LLMs",
        "link": "https://www.interconnects.ai/p/thoughts-on-the-hiring-market-in",
        "published": "Fri, 30 Jan 2026 15:49",
        "summary": "On standing out and finding gems.",
        "source": "Interconnects"
    },
    {
        "title": "The AI Hype Index: Grok makes porn, and Claude Code nails your job",
        "link": "https://www.technologyreview.com/2026/01/29/1131787/the-ai-hype-index-grok-makes-porn-claude-code-nails-your-job/",
        "published": "Thu, 29 Jan 2026 20:56",
        "summary": "Everyone is panicking because AI is very bad; everyone is panicking because AI is very good. It’s just that you never know which one you’re going to get. Grok is a pornography machine. Claude Code can do anything from building websites to reading your MRI. So of course Gen Z is spooked by what this&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "DHS is using Google and Adobe AI to make videos",
        "link": "https://www.technologyreview.com/2026/01/29/1131938/dhs-is-using-google-and-adobe-ai-to-make-videos/",
        "published": "Thu, 29 Jan 2026 18:57",
        "summary": "The US Department of Homeland Security is using AI video generators from Google and Adobe to make and edit content shared with the public, a new document reveals. It comes as immigration agencies have flooded social media with content to support President Trump&#8217;s mass deportation agenda—some of which appears to be made with AI—and as&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Project Genie: Experimenting with infinite, interactive worlds",
        "link": "https://deepmind.google/blog/project-genie-experimenting-with-infinite-interactive-worlds/",
        "published": "Thu, 29 Jan 2026 17:01",
        "summary": "Google AI Ultra subscribers in the U.S. can try out Project Genie, an experimental research prototype that lets you create and explore worlds.",
        "source": "DeepMind"
    },
    {
        "title": "What AI “remembers” about you is privacy’s next frontier",
        "link": "https://www.technologyreview.com/2026/01/28/1131835/what-ai-remembers-about-you-is-privacys-next-frontier/",
        "published": "Wed, 28 Jan 2026 14:57",
        "summary": "The ability to remember you and your preferences is rapidly becoming a big selling point for AI chatbots and agents.&#160; Earlier this month, Google announced Personal Intelligence, a new way for people to interact with the company’s Gemini chatbot that draws on their Gmail, photos, search, and YouTube histories to make Gemini “more personal, proactive,&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Rules fail at the prompt, succeed at the boundary",
        "link": "https://www.technologyreview.com/2026/01/28/1131003/rules-fail-at-the-prompt-succeed-at-the-boundary/",
        "published": "Wed, 28 Jan 2026 14:00",
        "summary": "From the Gemini Calendar prompt-injection attack of 2026 to the September 2025 state-sponsored hack using Anthropic’s Claude code as an automated intrusion engine, the coercion of human-in-the-loop agentic actions and fully autonomous agentic workflows are the new attack vector for hackers. In the Anthropic case, roughly 30 organizations across tech, finance, manufacturing, and government were&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Arcee AI goes all-in on open models built in the U.S.",
        "link": "https://www.interconnects.ai/p/arcee-ai-goes-all-in-on-open-models",
        "published": "Tue, 27 Jan 2026 22:47",
        "summary": "Interconnects interview #16 to celebrate the release of Trinity Large.",
        "source": "Interconnects"
    }
]