[
    {
        "title": "The Building Company",
        "link": "https://www.hyperdimensional.co/p/the-building-company",
        "published": "Fri, 12 Sep 2025 12:45",
        "summary": "A vignette ",
        "source": "Hyperdimensional"
    },
    {
        "title": "How do AI models generate videos?",
        "link": "https://www.technologyreview.com/2025/09/12/1123562/how-do-ai-models-generate-videos/",
        "published": "Fri, 12 Sep 2025 10:01",
        "summary": "MIT Technology Review Explains: Let our writers untangle the complex, messy world of technology to help you understand what’s coming next. You can read more from the series here. It’s been a big year for video generation. In the last nine months OpenAI made Sora public, Google DeepMind launched Veo 3, the video startup Runway&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Latest open artifacts (#14): NVIDIA's rise, \"Swiss & UAE DeepSeek,\" and a resurgence of open data ",
        "link": "https://www.interconnects.ai/p/latest-open-artifacts-14-nvidias",
        "published": "Thu, 11 Sep 2025 14:41",
        "summary": "While Qwen takes some rest, others continue to fuel the open model space.",
        "source": "Interconnects"
    },
    {
        "title": "Partnering with generative AI in the finance function",
        "link": "https://www.technologyreview.com/2025/09/11/1123508/partnering-with-generative-ai-in-the-finance-function/",
        "published": "Thu, 11 Sep 2025 13:00",
        "summary": "Generative AI has the potential to transform the finance function. By taking on some of the more mundane tasks that can occupy a lot of time, generative AI tools can help free up capacity for more high-value strategic work. For chief financial officers, this could mean spending more time and energy on proactively advising the&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "On China's open source AI trajectory",
        "link": "https://www.interconnects.ai/p/on-chinas-open-source-ai-trajectory",
        "published": "Tue, 09 Sep 2025 13:52",
        "summary": "Notes and predictions for the next phase of Chinese (open) AI models.",
        "source": "Interconnects"
    },
    {
        "title": "Help! My therapist is secretly using ChatGPT",
        "link": "https://www.technologyreview.com/2025/09/09/1123386/help-my-therapist-is-secretly-using-chatgpt/",
        "published": "Tue, 09 Sep 2025 09:00",
        "summary": "In Silicon Valley’s imagined future, AI models are so empathetic that we’ll use them as therapists. They’ll provide mental-health care for millions, unimpeded by the pesky requirements for human counselors, like the need for graduate degrees, malpractice insurance, and sleep. Down here on Earth, something very different has been happening.&#160; Last week, we published a&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Three big things we still don’t know about AI’s energy burden",
        "link": "https://www.technologyreview.com/2025/09/09/1123408/three-big-things-we-still-dont-know-about-ais-energy-burden/",
        "published": "Tue, 09 Sep 2025 09:00",
        "summary": "Earlier this year, when my colleague Casey Crownhart and I spent six months researching the climate and energy burden of AI, we came to see one number in particular as our white whale: how much energy the leading AI models, like ChatGPT or Gemini, use up when generating a single response.&#160; This fundamental number remained&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "How Yichao “Peak” Ji became a global AI app hitmaker",
        "link": "https://www.technologyreview.com/2025/09/08/1122642/ji-peak-yichao-innovator-manus-app-ai/",
        "published": "Mon, 08 Sep 2025 10:30",
        "summary": "Yichao “Peak” Ji is one of MIT Technology Review’s 2025 Innovators Under 35. Meet the rest of this year’s honorees.  When Yichao Ji—also known as “Peak”—appeared in a launch video for Manus in March, he didn’t expect it to go viral. Speaking in fluent English, the 32-year-old introduced the AI agent built by Chinese startup Butterfly&#8230;",
        "source": "Technology Review"
    }
]