[
    {
        "title": "How I Write",
        "link": "https://www.interconnects.ai/p/how-i-write",
        "published": "Fri, 06 Jun 2025 15:23",
        "summary": "Therein how I think, how AI impacts it, and how writing reflects upon AI progress.",
        "source": "Interconnects"
    },
    {
        "title": "Manus has kick-started an AI agent boom in China",
        "link": "https://www.technologyreview.com/2025/06/05/1117958/china-ai-agent-boom/",
        "published": "Thu, 05 Jun 2025 18:45",
        "summary": "Last year, China saw a boom in foundation models, the do-everything large language models that underpin the AI revolution. This year, the focus has shifted to AI agents—systems that are less about responding to users’ queries and more about autonomously accomplishing things for them.&#160; There are now a host of Chinese startups building these general-purpose&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "A taxonomy for next-generation reasoning models",
        "link": "https://www.interconnects.ai/p/next-gen-reasoners",
        "published": "Wed, 04 Jun 2025 12:02",
        "summary": "Where we've been and where we're going with RLVR.",
        "source": "Interconnects"
    },
    {
        "title": "What’s next for AI and math",
        "link": "https://www.technologyreview.com/2025/06/04/1117753/whats-next-for-ai-and-math/",
        "published": "Wed, 04 Jun 2025 08:21",
        "summary": "MIT Technology Review’s What’s Next series looks across industries, trends, and technologies to give you a first look at the future. You can read the rest of them here. The way DARPA tells it, math is stuck in the past. In April, the US Defense Advanced Research Projects Agency kicked off a new initiative called expMath—short&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Advanced audio dialog and generation with Gemini 2.5",
        "link": "https://deepmind.google/discover/blog/advanced-audio-dialog-and-generation-with-gemini-25/",
        "published": "Tue, 03 Jun 2025 17:15",
        "summary": "Gemini 2.5 has new capabilities in AI-powered audio dialog and generation.",
        "source": "DeepMind"
    },
    {
        "title": "Inside the effort to tally AI’s energy appetite",
        "link": "https://www.technologyreview.com/2025/06/03/1117685/inside-the-tedious-effort-to-tally-ais-energy-appetite/",
        "published": "Tue, 03 Jun 2025 09:00",
        "summary": "After working on it for months, my colleague Casey Crownhart and I finally saw our story on AI’s energy and emissions burden go live last week.&#160; The initial goal sounded simple: Calculate how much energy is used each time we interact with a chatbot, and then tally that up to understand why everyone from leaders&#8230;",
        "source": "Technology Review"
    }
]