[
    {
        "title": "Categories of Inference-Time Scaling for Improved LLM Reasoning",
        "link": "https://magazine.sebastianraschka.com/p/categories-of-inference-time-scaling",
        "published": "Sat, 24 Jan 2026 11:23",
        "summary": "And an Overview of Recent Inference-Scaling Papers (Including Recursive Language Models)",
        "source": "Ahead of AI"
    },
    {
        "title": "America’s coming war over AI regulation",
        "link": "https://www.technologyreview.com/2026/01/23/1131559/americas-coming-war-over-ai-regulation/",
        "published": "Fri, 23 Jan 2026 10:00",
        "summary": "MIT Technology Review’s What’s Next series looks across industries, trends, and technologies to give you a first look at the future. You can read the rest of them here. In the final weeks of 2025, the battle over regulating artificial intelligence in the US reached a boiling point. On December 11, after Congress failed twice&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "“Dr. Google” had its issues. Can ChatGPT Health do better?",
        "link": "https://www.technologyreview.com/2026/01/22/1131692/dr-google-had-its-issues-can-chatgpt-health-do-better/",
        "published": "Thu, 22 Jan 2026 17:38",
        "summary": "For the past two decades, there’s been a clear first step for anyone who starts experiencing new medical symptoms: Look them up online. The practice was so common that it gained the pejorative moniker “Dr. Google.” But times are changing, and many medical-information seekers are now using LLMs. According to OpenAI, 230 million people ask&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "On AI and Children",
        "link": "https://www.hyperdimensional.co/p/on-ai-and-children",
        "published": "Thu, 22 Jan 2026 14:46",
        "summary": "Five-and-a-half conjectures",
        "source": "Hyperdimensional"
    },
    {
        "title": "Yann LeCun’s new venture is a contrarian bet against large language models",
        "link": "https://www.technologyreview.com/2026/01/22/1131661/yann-lecuns-new-venture-ami-labs/",
        "published": "Thu, 22 Jan 2026 10:00",
        "summary": "Yann LeCun is a Turing Award recipient and a top AI researcher, but he has long been a contrarian figure in the tech world. He believes that the industry’s current obsession with large language models is wrong-headed and will ultimately fail to solve many pressing problems.&#160; Instead, he thinks we should be betting on world&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Get Good at Agents",
        "link": "https://www.interconnects.ai/p/get-good-at-agents",
        "published": "Wed, 21 Jan 2026 17:05",
        "summary": "The tools are getting so powerful that we need to change how we scope, manage, and approach our work.",
        "source": "Interconnects"
    },
    {
        "title": "Rethinking AI’s future in an augmented workplace",
        "link": "https://www.technologyreview.com/2026/01/21/1131366/rethinking-ais-future-in-an-augmented-workplace/",
        "published": "Wed, 21 Jan 2026 15:00",
        "summary": "There are many paths AI evolution could take. On one end of the spectrum, AI is dismissed as a marginal fad, another bubble fueled by notoriety and misallocated capital. On the other end, it’s cast as a dystopian force, destined to eliminate jobs on a large scale and destabilize economies. Markets oscillate between skepticism and&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Everyone wants AI sovereignty. No one can truly have it.",
        "link": "https://www.technologyreview.com/2026/01/21/1131513/everyone-wants-ai-sovereignty-no-one-can-truly-have-it/",
        "published": "Wed, 21 Jan 2026 14:00",
        "summary": "Governments plan to pour $1.3 trillion into AI infrastructure by 2030 to invest in “sovereign AI,” with the premise being that countries should be in control of their own AI capabilities. The funds include financing for domestic data centers, locally trained models, independent supply chains, and national talent pipelines. This is a response to real&#8230;",
        "source": "Technology Review"
    }
]