[
    {
        "title": "GPT-4o's images and lessons from native input-output multimodality",
        "link": "https://www.interconnects.ai/p/gpt-4os-images-and-lessons-from-native",
        "published": "Sun, 30 Mar 2025 16:33",
        "summary": "Hints of a natively multi-modal future.",
        "source": "Interconnects"
    },
    {
        "title": "First Look at Reasoning From Scratch: Chapter 1",
        "link": "https://magazine.sebastianraschka.com/p/first-look-at-reasoning-from-scratch",
        "published": "Sat, 29 Mar 2025 11:11",
        "summary": "An introduction to reasoning in today's LLMs",
        "source": "Ahead of AI"
    },
    {
        "title": "The first trial of generative AI therapy shows it might help with depression",
        "link": "https://www.technologyreview.com/2025/03/28/1114001/the-first-trial-of-generative-ai-therapy-shows-it-might-help-with-depression/",
        "published": "Fri, 28 Mar 2025 17:07",
        "summary": "The first clinical trial of a therapy bot that uses generative AI suggests it was as effective as human therapy for participants with depression, anxiety, or risk for developing eating disorders. Even so, it doesn’t give a go-ahead to the dozens of companies hyping such technologies while operating in a regulatory gray area.&#160; A team&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Anthropic can now track the bizarre inner workings of a large language model",
        "link": "https://www.technologyreview.com/2025/03/27/1113916/anthropic-can-now-track-the-bizarre-inner-workings-of-a-large-language-model/",
        "published": "Thu, 27 Mar 2025 17:00",
        "summary": "The AI firm Anthropic has developed a way to peer inside a large language model and watch what it does as it comes up with a response, revealing key new insights into how the technology works. The takeaway: LLMs are even stranger than we thought. The Anthropic team was surprised by some of the counterintuitive&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Where We Are Headed ",
        "link": "https://www.hyperdimensional.co/p/where-we-are-headed",
        "published": "Thu, 27 Mar 2025 12:45",
        "summary": "A rough sketch of the near future (part one)",
        "source": "Hyperdimensional"
    },
    {
        "title": "Gemini 2.5 Pro and Google's second chance with AI",
        "link": "https://www.interconnects.ai/p/gemini-25-pro-googles-second-ai-chance",
        "published": "Wed, 26 Mar 2025 12:01",
        "summary": "Plus some coverage for the latest DeepSeek.",
        "source": "Interconnects"
    },
    {
        "title": "The AI Hype Index: DeepSeek mania, Israel’s spying tool, and cheating at chess",
        "link": "https://www.technologyreview.com/2025/03/26/1113694/ai-hype-index-artificial-intelligence-openai-manus-doge/",
        "published": "Wed, 26 Mar 2025 09:00",
        "summary": "Separating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry. While AI models are certainly capable of creating interesting and sometimes entertaining material, their output isn’t necessarily useful. Google DeepMind is hoping that&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "China built hundreds of AI data centers to catch the AI boom. Now many stand unused.",
        "link": "https://www.technologyreview.com/2025/03/26/1113802/china-ai-data-centers-unused/",
        "published": "Wed, 26 Mar 2025 09:00",
        "summary": "A year or so ago, Xiao Li was seeing floods of Nvidia chip deals on WeChat. A real estate contractor turned data center project manager, he had pivoted to AI infrastructure in 2023, drawn by the promise of China’s AI craze.&#160; At that time, traders in his circle bragged about securing shipments of high-performing Nvidia&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "OpenAI’s new image generator aims to be practical enough for designers and advertisers",
        "link": "https://www.technologyreview.com/2025/03/25/1113745/openais-new-image-generator-aims-to-be-practical-enough-for-designers-and-advertisers/",
        "published": "Tue, 25 Mar 2025 18:00",
        "summary": "OpenAI has released a new image generator that’s designed less for typical surrealist AI art and more for highly controllable and practical creation of visuals—a sign that OpenAI thinks its tools are ready for use in fields like advertising and graphic design.&#160; The image generator, which is now part of the company’s GPT-4o model, was&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Gemini 2.5: Our most intelligent AI model",
        "link": "https://deepmind.google/discover/blog/gemini-2-5-our-most-intelligent-ai-model/",
        "published": "Tue, 25 Mar 2025 17:00",
        "summary": "Gemini 2.5 is our most intelligent AI model, now with thinking built in.",
        "source": "DeepMind"
    }
]