[
    {
        "title": "Fueling seamless AI at scale",
        "link": "https://www.technologyreview.com/2025/05/30/1117440/fueling-seamless-ai-at-scale/",
        "published": "Fri, 30 May 2025 14:00",
        "summary": "From large language models (LLMs) to reasoning agents, today’s AI tools bring unprecedented computational demands. Trillion-parameter models, workloads running on-device, and swarms of agents collaborating to complete tasks all require a new paradigm of computing to become truly seamless and ubiquitous. First, technical progress in hardware and silicon design is critical to pushing the boundaries&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "This benchmark used Reddit’s AITA to test how much AI models suck up to us",
        "link": "https://www.technologyreview.com/2025/05/30/1117551/this-benchmark-used-reddits-aita-to-test-how-much-ai-models-suck-up-to-us/",
        "published": "Fri, 30 May 2025 09:00",
        "summary": "Back in April, OpenAIannounced it was rolling back an update to its GPT-4o model that made ChatGPT’s responses to user queries too sycophantic.&#160; An AI model that acts in an overly agreeable and flattering way is more than just annoying. It could reinforce users’ incorrect beliefs, mislead people, and spread misinformation that can be dangerous—a&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Latest open artifacts (#10): New DeepSeek R1 0528!, more permissive licenses, everything as a reasoner, and from artifacts to agents",
        "link": "https://www.interconnects.ai/p/latest-open-artifacts-10-new-deepseek",
        "published": "Thu, 29 May 2025 13:37",
        "summary": "Artifacts Log 10. ",
        "source": "Interconnects"
    },
    {
        "title": "The AI Hype Index: College students are hooked on ChatGPT",
        "link": "https://www.technologyreview.com/2025/05/28/1117468/ai-hype-index-college-students-chatgpt-meta-apple-anthropic-grok/",
        "published": "Wed, 28 May 2025 14:13",
        "summary": "Separating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry. Large language models confidently present their responses as accurate and reliable, even when they’re neither of those things. That’s why we’ve recently seen&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Reinforcement learning with random rewards actually works with Qwen 2.5",
        "link": "https://www.interconnects.ai/p/reinforcement-learning-with-random",
        "published": "Tue, 27 May 2025 16:39",
        "summary": "Making sense of research casting doubt on the potential of RLVR and where I'm optimistic for the next phase of scaling.",
        "source": "Interconnects"
    },
    {
        "title": "Claude 4 and Anthropic's bet on code",
        "link": "https://www.interconnects.ai/p/claude-4-and-anthropics-bet-on-code",
        "published": "Tue, 27 May 2025 12:03",
        "summary": "Reasons to be optimistic and pessimistic on Anthropic's future.",
        "source": "Interconnects"
    }
]