[
    {
        "title": "The AI Hype Index: The people can’t get enough of AI slop",
        "link": "https://www.technologyreview.com/2025/11/26/1128353/the-ai-hype-index-the-people-cant-get-enough-of-ai-slop/",
        "published": "Wed, 26 Nov 2025 10:00",
        "summary": "Separating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry. Last year, the fantasy author Joanna Maciejewska went viral (if such a thing is still possible on X) with a post saying “I&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The State of AI: Chatbot companions and the future of our privacy",
        "link": "https://www.technologyreview.com/2025/11/24/1128051/the-state-of-ai-chatbot-companions-and-the-future-of-our-privacy/",
        "published": "Mon, 24 Nov 2025 16:30",
        "summary": "Welcome back to The State of AI, a new collaboration between the Financial Times and MIT Technology Review. Every Monday, writers from both publications debate one aspect of the generative AI revolution reshaping global power. In this week&#8217;s conversation MIT Technology Review’s senior reporter for features and investigations, Eileen Guo, and FT tech correspondent Melissa&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "What’s next for AlphaFold: A conversation with a Google DeepMind Nobel laureate",
        "link": "https://www.technologyreview.com/2025/11/24/1128322/whats-next-for-alphafold-a-conversation-with-a-google-deepmind-nobel-laureate/",
        "published": "Mon, 24 Nov 2025 16:21",
        "summary": "In 2017, fresh off a PhD on theoretical chemistry, John Jumper heard rumors that Google DeepMind had moved on from building AI that played games with superhuman skill and was starting up a secret project to predict the structures of proteins. He applied for a job. Just three years later, Jumper celebrated a stunning win&#8230;",
        "source": "Technology Review"
    }
]