[
    {
        "title": "How AI is interacting with our creative human processes",
        "link": "https://www.technologyreview.com/2025/04/11/1114266/artificial-intelligence-book-reviews-vauhini-vara-david-hajdu-pria-anand/",
        "published": "Fri, 11 Apr 2025 09:00",
        "summary": "In 2021, 20 years after the death of her older sister, Vauhini Vara was still unable to tell the story of her loss. “I wondered,” she writes in Searches, her new collection of essays on AI technology, “if Sam Altman’s machine could do it for me.” So she tried ChatGPT. But as it expanded on&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Generative AI is learning to spy for the US military",
        "link": "https://www.technologyreview.com/2025/04/11/1114914/generative-ai-is-learning-to-spy-for-the-us-military/",
        "published": "Fri, 11 Apr 2025 09:00",
        "summary": "For much of last year, about 2,500 US service members from the 15th Marine Expeditionary Unit sailed aboard three ships throughout the Pacific, conducting training exercises in the waters off South Korea, the Philippines, India, and Indonesia. At the same time, onboard the ships, an experiment was unfolding: The Marines in the unit responsible for&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "How I Work",
        "link": "https://www.hyperdimensional.co/p/how-i-work",
        "published": "Thu, 10 Apr 2025 12:45",
        "summary": "Some introspection, and career advice of a sort",
        "source": "Hyperdimensional"
    },
    {
        "title": "How AI can help supercharge creativity",
        "link": "https://www.technologyreview.com/2025/04/10/1114256/ai-creativity-art-collaboration-music/",
        "published": "Thu, 10 Apr 2025 09:00",
        "summary": "Sometimes Lizzie Wilson shows up to a rave with her AI sidekick.&#160; One weeknight this past February, Wilson plugged her laptop into a projector that threw her screen onto the wall of a low-ceilinged loft space in East London. A small crowd shuffled in the glow of dim pink lights. Wilson sat down and started&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "AI companions are the final stage of digital addiction, and lawmakers are taking aim",
        "link": "https://www.technologyreview.com/2025/04/08/1114369/ai-companions-are-the-final-stage-of-digital-addiction-and-lawmakers-are-taking-aim/",
        "published": "Tue, 08 Apr 2025 09:00",
        "summary": "On Tuesday, California state senator Steve Padilla will make an appearance with Megan Garcia, the mother of a Florida teen who killed himself following a relationship with an AI companion that Garcia alleges contributed to her son’s death.&#160; The two will announce a new bill that would force the tech companies behind such AI companions&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Llama 4: Did Meta just push the panic button?",
        "link": "https://www.interconnects.ai/p/llama-4",
        "published": "Mon, 07 Apr 2025 12:03",
        "summary": "One of the weirdest releases of the year and understanding the future of the Llama endeavor. For the time being, we have some more amazing open weight models!",
        "source": "Interconnects"
    }
]