[
    {
        "title": "Harnessing human-AI collaboration for an AI roadmap that moves beyond pilots",
        "link": "https://www.technologyreview.com/2025/12/05/1128730/harnessing-human-ai-collaboration-for-an-ai-roadmap-that-moves-beyond-pilots/",
        "published": "Fri, 05 Dec 2025 15:00",
        "summary": "The past year has marked a turning point in the corporate AI conversation. After a period of eager experimentation, organizations are now confronting a more complex reality: While investment in AI has never been higher, the path from pilot to production remains elusive. Three-quarters of enterprises remain stuck in experimentation mode, despite mounting pressure to&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The era of AI persuasion in elections is about to begin",
        "link": "https://www.technologyreview.com/2025/12/05/1128837/the-era-of-ai-persuasion-in-elections-is-about-to-begin/",
        "published": "Fri, 05 Dec 2025 10:00",
        "summary": "In January 2024, the phone rang in homes all around New Hampshire. On the other end was Joe Biden’s voice, urging Democrats to “save your vote” by skipping the primary. It sounded authentic, but it wasn’t. The call was a fake, generated by artificial intelligence. Today, the technology behind that hoax looks quaint. Tools like&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "AI chatbots can sway voters better than political advertisements",
        "link": "https://www.technologyreview.com/2025/12/04/1128824/ai-chatbots-can-sway-voters-better-than-political-advertisements/",
        "published": "Thu, 04 Dec 2025 19:54",
        "summary": "In 2024, a Democratic congressional candidate in Pennsylvania, Shamaine Daniels, used an AI chatbot named Ashley to call voters and carry on conversations with them. “Hello. My name is Ashley, and I’m an artificial intelligence volunteer for Shamaine Daniels’s run for Congress,” the calls began. Daniels didn’t ultimately win. But maybe those calls helped her&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Engineering more resilient crops for a warming climate",
        "link": "https://deepmind.google/blog/engineering-more-resilient-crops-for-a-warming-climate/",
        "published": "Thu, 04 Dec 2025 16:23",
        "summary": "Scientists are using AlphaFold to strengthen a photosynthesis enzyme for resilient, heat-tolerant crops.",
        "source": "DeepMind"
    },
    {
        "title": "Delivering securely on data and AI strategy",
        "link": "https://www.technologyreview.com/2025/12/04/1128311/delivering-securely-on-data-and-ai-strategy/",
        "published": "Thu, 04 Dec 2025 14:00",
        "summary": "Most organizations feel the imperative to keep pace with continuing advances in AI capabilities, as highlighted in a recent MIT Technology Review Insights report. That clearly has security implications, particularly as organizations navigate a surge in the volume, velocity, and variety of security data. This explosion of data, coupled with fragmented toolchains, is making it&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "OpenAI has trained its LLM to confess to bad behavior",
        "link": "https://www.technologyreview.com/2025/12/03/1128740/openai-has-trained-its-llm-to-confess-to-bad-behavior/",
        "published": "Wed, 03 Dec 2025 18:01",
        "summary": "OpenAI is testing another new way to expose the complicated processes at work inside large language models. Researchers at the company can make an LLM produce what they call a confession, in which the model explains how it carried out a task and (most of the time) owns up to any bad behavior. Figuring out&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "From DeepSeek V3 to V3.2: Architecture, Sparse Attention, and RL Updates",
        "link": "https://magazine.sebastianraschka.com/p/technical-deepseek",
        "published": "Wed, 03 Dec 2025 12:03",
        "summary": "Understanding How DeepSeek's Flagship Open-Weight Models Evolved",
        "source": "Ahead of AI"
    },
    {
        "title": "Heiliger Dankgesang",
        "link": "https://www.hyperdimensional.co/p/heiliger-dankgesang",
        "published": "Mon, 01 Dec 2025 13:45",
        "summary": "Reflections on Claude Opus 4.5",
        "source": "Hyperdimensional"
    }
]