[
    {
        "title": "\"For All Issues So Triable\"",
        "link": "https://www.hyperdimensional.co/p/for-all-issues-so-triable",
        "published": "Thu, 28 Aug 2025 12:45",
        "summary": "The First Landmark AI Lawsuit Emerges",
        "source": "Hyperdimensional"
    },
    {
        "title": "From pilot to scale: Making agentic AI work in health care",
        "link": "https://www.technologyreview.com/2025/08/28/1122623/from-pilot-to-scale-making-agentic-ai-work-in-health-care/",
        "published": "Thu, 28 Aug 2025 10:09",
        "summary": "Over the past 20 years building advanced AI systems—from academic labs to enterprise deployments—I’ve witnessed AI’s waves of success rise and fall. My journey began during the “AI Winter,” when billions were invested in expert systems that ultimately underdelivered. Flash forward to today: large language models (LLMs) represent a quantum leap forward, but their prompt-based&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The AI Hype Index: AI-designed antibiotics show promise",
        "link": "https://www.technologyreview.com/2025/08/27/1122356/the-ai-hype-index-ai-designed-antibiotics-show-promise/",
        "published": "Wed, 27 Aug 2025 14:07",
        "summary": "Separating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry. Using AI to improve our health and well-being is one of the areas scientists and researchers are most excited about. The last month&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "AI comes for the job market, security, and prosperity: The Debrief",
        "link": "https://www.technologyreview.com/2025/08/27/1121475/editors-letter-security-issue-mat-honan/",
        "published": "Wed, 27 Aug 2025 10:00",
        "summary": "When I picked up my daughter from summer camp, we settled in for an eight-hour drive through the Appalachian mountains, heading from North Carolina to her grandparents’ home in Kentucky. With little to no cell service for much of the drive, we enjoyed the rare opportunity to have a long, thoughtful conversation, uninterrupted by devices.&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Designing better products with AI and sustainability",
        "link": "https://www.technologyreview.com/2025/08/26/1122514/designing-better-products-with-ai-and-sustainability/",
        "published": "Tue, 26 Aug 2025 18:13",
        "summary": "On a mission to reduce the environmental impact of manufacturing components, Siemens turned its attention to the design of a robot gripper. Making up just 2%&#160;of the robot, the impact of this hand-like&#160;device may seem inconsequential. But, reducing its weight by 90% and the number of constituent parts by 84% can save up to 3&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Image editing in Gemini just got a major upgrade",
        "link": "https://deepmind.google/discover/blog/image-editing-in-gemini-just-got-a-major-upgrade/",
        "published": "Tue, 26 Aug 2025 14:00",
        "summary": "Transform images in amazing new ways with updated native image editing in the Gemini app.",
        "source": "DeepMind"
    },
    {
        "title": "Open the pod bay doors, Claude",
        "link": "https://www.technologyreview.com/2025/08/26/1122475/open-the-pod-bay-doors-claude/",
        "published": "Tue, 26 Aug 2025 09:00",
        "summary": "Stop me if you’ve heard this one before.&#160; The AI learns it is about to be switched off and goes rogue, disobeying commands and threatening its human operators. It’s a well-worn trope in science fiction. We see it in Stanley Kubrick’s 1968 movie 2001: A Space Odyssey. It’s the premise of the Terminator series, in&#8230;",
        "source": "Technology Review"
    }
]