[
    {
        "title": "What I've been reading (#2): More on Kimi K2, how to build a bad research center, Pretraining with RL, and sporks of AGI",
        "link": "https://www.interconnects.ai/p/what-im-reading-2-more-on-kimi-k2",
        "published": "Sun, 10 Aug 2025 13:19",
        "summary": "A quiet summer is all you need.",
        "source": "Interconnects"
    },
    {
        "title": "From GPT-2 to gpt-oss: Analyzing the Architectural Advances",
        "link": "https://magazine.sebastianraschka.com/p/from-gpt-2-to-gpt-oss-analyzing-the",
        "published": "Sat, 09 Aug 2025 11:23",
        "summary": "And How They Stack Up Against Qwen3",
        "source": "Ahead of AI"
    },
    {
        "title": "GPT-5 and the arc of progress",
        "link": "https://www.interconnects.ai/p/gpt-5-and-bending-the-arc-of-progress",
        "published": "Thu, 07 Aug 2025 22:20",
        "summary": "Overpromising will always lead to some sort of underdelivering, but what we're getting is still phenomenal. ",
        "source": "Interconnects"
    },
    {
        "title": "GPT-5 is here. Now what?",
        "link": "https://www.technologyreview.com/2025/08/07/1121308/gpt-5-is-here-now-what/",
        "published": "Thu, 07 Aug 2025 17:00",
        "summary": "At long last, OpenAI has released GPT-5. The new system abandons the distinction between OpenAI’s flagship models and its o series of reasoning models, automatically routing user queries to a fast nonreasoning model or a slower reasoning version. It is now available to everyone through the ChatGPT web interface—though nonpaying users may need to wait&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "How AI is helping advance the science of bioacoustics to save endangered species",
        "link": "https://deepmind.google/discover/blog/how-ai-is-helping-advance-the-science-of-bioacoustics-to-save-endangered-species/",
        "published": "Thu, 07 Aug 2025 14:59",
        "summary": "Our new Perch model helps conservationists analyze audio faster to protect endangered species, from Hawaiian honeycreepers to coral reefs.",
        "source": "DeepMind"
    },
    {
        "title": "Five ways that AI is learning to improve itself",
        "link": "https://www.technologyreview.com/2025/08/06/1121193/five-ways-that-ai-is-learning-to-improve-itself/",
        "published": "Wed, 06 Aug 2025 15:14",
        "summary": "Last week, Mark Zuckerberg declared that Meta is aiming to achieve smarter-than-human AI. He seems to have a recipe for achieving that goal, and the first ingredient is human talent: Zuckerberg has reportedly tried to lure top researchers to Meta Superintelligence Labs with nine-figure offers. The second ingredient is AI itself.&#160; Zuckerberg recently said on&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "gpt-oss: OpenAI validates the open ecosystem (finally)",
        "link": "https://www.interconnects.ai/p/gpt-oss-openai-validates-the-open",
        "published": "Tue, 05 Aug 2025 17:24",
        "summary": "OpenAI's first open language model release since GPT 2 and what it means for the ecosystem.",
        "source": "Interconnects"
    },
    {
        "title": "OpenAI has finally released open-weight language models",
        "link": "https://www.technologyreview.com/2025/08/05/1121092/openai-has-finally-released-open-weight-language-models/",
        "published": "Tue, 05 Aug 2025 17:00",
        "summary": "OpenAI has finally released its first open-weight large language models since 2019’s GPT-2. These new “gpt-oss” models are available in two different sizes and score similarly to the company’s o3-mini and o4-mini models on several benchmarks. Unlike the models available through OpenAI’s web interface, these new open models can be freely downloaded, run, and even&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Genie 3: A new frontier for world models",
        "link": "https://deepmind.google/discover/blog/genie-3-a-new-frontier-for-world-models/",
        "published": "Tue, 05 Aug 2025 14:00",
        "summary": "Genie 3 can generate dynamic worlds that you can navigate in real time at 24 frames per second, retaining consistency for a few minutes at a resolution of 720p.",
        "source": "DeepMind"
    },
    {
        "title": "A glimpse into OpenAI’s largest ambitions",
        "link": "https://www.technologyreview.com/2025/08/05/1121052/a-glimpse-into-openais-largest-ambitions/",
        "published": "Tue, 05 Aug 2025 09:00",
        "summary": "OpenAI has given itself a dual mandate. On the one hand, it’s a tech giant rooted in products, including of course ChatGPT, which people around the world reportedly send 2.5 billion requests to each day. But its original mission is to serve as a research lab that will not only create “artificial general intelligence” but&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Rethinking how we measure AI intelligence",
        "link": "https://deepmind.google/discover/blog/rethinking-how-we-measure-ai-intelligence/",
        "published": "Mon, 04 Aug 2025 16:07",
        "summary": "Game Arena is a new, open-source platform for rigorous evaluation of AI models. It allows for head-to-head comparison of frontier systems in environments with clear winning conditions.",
        "source": "DeepMind"
    },
    {
        "title": "These protocols will help AI agents navigate our messy lives",
        "link": "https://www.technologyreview.com/2025/08/04/1120996/protocols-help-agents-navigate-lives-mcp-a2a/",
        "published": "Mon, 04 Aug 2025 15:00",
        "summary": "A growing number of companies are launching AI agents that can do things on your behalf—actions like sending an email, making a document, or editing a database. Initial reviews for these agents have been mixed at best, though, because they struggle to interact with all the different components of our digital lives. Part of the&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Towards American Truly Open Models: The ATOM Project",
        "link": "https://www.interconnects.ai/p/atom-project",
        "published": "Mon, 04 Aug 2025 14:09",
        "summary": "Rebranding American DeepSeek into a more lasting brand. From an idea to a coalition with real impact.",
        "source": "Interconnects"
    }
]