[
    {
        "title": "Eyes on the Street",
        "link": "https://www.hyperdimensional.co/p/eyes-on-the-street",
        "published": "Sun, 03 Aug 2025 13:00",
        "summary": "",
        "source": "Hyperdimensional"
    },
    {
        "title": "Forcing LLMs to be evil during training can make them nicer in the long run",
        "link": "https://www.technologyreview.com/2025/08/01/1120924/forcing-llms-to-be-evil-during-training-can-make-them-nicer-in-the-long-run/",
        "published": "Fri, 01 Aug 2025 16:00",
        "summary": "A new study from Anthropic suggests that traits such as sycophancy or evilness are associated with specific patterns of activity in large language models—and turning on those patterns during training can, paradoxically, prevent the model from adopting the related traits. Large language models have recently acquired a reputation for behaving badly. In April, ChatGPT suddenly&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Try Deep Think in the Gemini app",
        "link": "https://deepmind.google/discover/blog/try-deep-think-in-the-gemini-app/",
        "published": "Fri, 01 Aug 2025 11:09",
        "summary": "Deep Think utilizes extended, parallel thinking and novel reinforcement learning techniques for significantly improved problem-solving.",
        "source": "DeepMind"
    },
    {
        "title": "The two people shaping the future of OpenAI’s research",
        "link": "https://www.technologyreview.com/2025/07/31/1120885/the-two-people-shaping-the-future-of-openais-research/",
        "published": "Thu, 31 Jul 2025 09:06",
        "summary": "For the past couple of years, OpenAI has felt like a one-man brand. With his showbiz style and fundraising glitz, CEO Sam Altman overshadows all other big names on the firm’s roster. Even his bungled ouster ended with him back on top—and more famous than ever. But look past the charismatic frontman and you get&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The AI Hype Index: The White House’s war on “woke AI”",
        "link": "https://www.technologyreview.com/2025/07/30/1120783/the-ai-hype-index-the-white-houses-war-on-woke-ai/",
        "published": "Wed, 30 Jul 2025 15:37",
        "summary": "Separating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry. The Trump administration recently declared war on so-called “woke AI,” issuing an executive order aimed at preventing companies whose models exhibit a liberal&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "AlphaEarth Foundations helps map our planet in unprecedented detail",
        "link": "https://deepmind.google/discover/blog/alphaearth-foundations-helps-map-our-planet-in-unprecedented-detail/",
        "published": "Wed, 30 Jul 2025 14:00",
        "summary": "New AI model integrates petabytes of Earth observation data to generate a unified data representation that revolutionizes global mapping and monitoring",
        "source": "DeepMind"
    },
    {
        "title": "OpenAI is launching a version of ChatGPT for college students",
        "link": "https://www.technologyreview.com/2025/07/29/1120801/openai-is-launching-a-version-of-chatgpt-for-college-students/",
        "published": "Tue, 29 Jul 2025 17:18",
        "summary": "OpenAI is launching Study Mode, a version of ChatGPT for college students that it promises will act less like a lookup tool and more like a friendly, always-available tutor. It’s part of a wider push by the company to get AI more embedded into classrooms when the new academic year starts in September. A demonstration&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Interviewing Ross Taylor on the state of AI: Chinese open models, scaling reasoning, useful tools, and what comes next",
        "link": "https://www.interconnects.ai/p/interviewing-ross-taylor-on-the-state",
        "published": "Tue, 29 Jul 2025 13:35",
        "summary": "Interconnects Interview #14. Ross's second time on the show.",
        "source": "Interconnects"
    },
    {
        "title": "What you may have missed about Trump’s AI Action Plan",
        "link": "https://www.technologyreview.com/2025/07/29/1120760/what-you-may-have-missed-about-trumps-ai-action-plan/",
        "published": "Tue, 29 Jul 2025 09:00",
        "summary": "A number of the executive orders and announcements coming from the White House since Donald Trump returned to office have painted an ambitious vision for America’s AI future—crushing competition with China, abolishing “woke” AI models that suppress conservative speech, jump-starting power-hungry AI data centers. But the details have been sparse.&#160; The White House’s AI Action&#8230;",
        "source": "Technology Review"
    }
]