[
    {
        "title": "xAI's Grok 4: The tension of frontier performance with a side of Elon favoritism",
        "link": "https://www.interconnects.ai/p/grok-4-an-o3-look-alike-in-search",
        "published": "Sat, 12 Jul 2025 14:41",
        "summary": "An o3 class model, the possibility of progress, chatbot beige, and the illusiveness of taste.",
        "source": "Interconnects"
    },
    {
        "title": "This tool strips away anti-AI protections from digital art",
        "link": "https://www.technologyreview.com/2025/07/10/1119937/tool-strips-away-anti-ai-protections-from-digital-art/",
        "published": "Thu, 10 Jul 2025 09:00",
        "summary": "A new technique called LightShed will make it harder for artists to use existing protective tools to stop their work from being ingested for AI training. It’s the next step in a cat-and-mouse game—across technology, law, and culture—that has been going on between artists and AI proponents for years.&#160; Generative AI models that create images&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Inside OpenAI’s empire: A conversation with Karen Hao",
        "link": "https://www.technologyreview.com/2025/07/09/1119784/inside-openais-empire-a-conversation-with-karen-hao/",
        "published": "Wed, 09 Jul 2025 09:10",
        "summary": "In a wide-ranging Roundtables conversation for MIT Technology Review subscribers, AI journalist and author Karen Hao spoke about her new book, Empire of AI: Dreams and Nightmares in Sam Altman’s OpenAI. She talked with executive editor Niall Firth about how she first covered the company in 2020 while on staff at MIT Technology Review, and&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Battling next-gen financial fraud",
        "link": "https://www.technologyreview.com/2025/07/08/1119039/battling-next-gen-financial-fraud/",
        "published": "Tue, 08 Jul 2025 13:24",
        "summary": "From a cluster of call centers in Canada, a criminal network defrauded elderly victims in the US out of $21 million in total between 2021 and 2024. The fraudsters used voice over internet protocol technology to&#160;dupe victims into believing the calls came from their grandchildren in the US, customizing conversations using banks of personal data,&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "How scientists are trying to use AI to unlock the human mind",
        "link": "https://www.technologyreview.com/2025/07/08/1119777/scientists-use-ai-unlock-human-mind/",
        "published": "Tue, 08 Jul 2025 09:30",
        "summary": "Today’s AI landscape is defined by the ways in which neural networks are unlike human brains. A toddler learns how to communicate effectively with only a thousand calories a day and regular conversation; meanwhile, tech companies are reopening nuclear power plants, polluting marginalized communities, and pirating terabytes of books in order to train and run&#8230;",
        "source": "Technology Review"
    }
]