[
    {
        "title": "Gemini 3 Deep Think: Advancing science, research and engineering",
        "link": "https://deepmind.google/blog/gemini-3-deep-think-advancing-science-research-and-engineering/",
        "published": "Thu, 12 Feb 2026 16:15",
        "summary": "Our most specialized reasoning mode is now updated to solve modern science, research and engineering challenges.",
        "source": "DeepMind"
    },
    {
        "title": "On Recursive Self-Improvement (Part II)",
        "link": "https://www.hyperdimensional.co/p/on-recursive-self-improvement-part-d9b",
        "published": "Thu, 12 Feb 2026 14:50",
        "summary": "What is the policymaker to do?",
        "source": "Hyperdimensional"
    },
    {
        "title": "AI is already making online crimes easier. It could get much worse.",
        "link": "https://www.technologyreview.com/2026/02/12/1132386/ai-already-making-online-swindles-easier/",
        "published": "Thu, 12 Feb 2026 11:00",
        "summary": "Anton Cherepanov is always on the lookout for something interesting. And in late August last year, he spotted just that. It was a file uploaded to VirusTotal, a site cybersecurity researchers like him use to analyze submissions for potential viruses and other types of malicious software, often known as malware. On the surface it seemed&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "What’s next for Chinese open-source AI",
        "link": "https://www.technologyreview.com/2026/02/12/1132811/whats-next-for-chinese-open-source-ai/",
        "published": "Thu, 12 Feb 2026 10:00",
        "summary": "MIT Technology Review’s What’s Next series looks across industries, trends, and technologies to give you a first look at the future. You can read the rest of them&#160;here. The past year has marked a turning point for Chinese AI. Since DeepSeek released its R1 reasoning model in January 2025, Chinese companies have repeatedly delivered AI&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Is a secure AI assistant possible?",
        "link": "https://www.technologyreview.com/2026/02/11/1132768/is-a-secure-ai-assistant-possible/",
        "published": "Wed, 11 Feb 2026 20:08",
        "summary": "AI agents are a risky business. Even when stuck inside the chatbox window, LLMs will make mistakes and behave badly. Once they have tools that they can use to interact with the outside world, such as web browsers and email addresses, the consequences of those mistakes become far more serious. That might explain why the&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "A “QuitGPT” campaign is urging people to cancel their ChatGPT subscriptions",
        "link": "https://www.technologyreview.com/2026/02/10/1132577/a-quitgpt-campaign-is-urging-people-to-cancel-chatgpt-subscriptions/",
        "published": "Tue, 10 Feb 2026 17:00",
        "summary": "In September, Alfred Stephen, a freelance software developer in Singapore, purchased a ChatGPT Plus subscription, which costs $20 a month and offers more access to advanced models, to speed up his work. But he grew frustrated with the chatbot’s coding abilities and its gushing, meandering replies. Then he came across a post on Reddit about&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Why the Moltbook frenzy was like Pokémon",
        "link": "https://www.technologyreview.com/2026/02/09/1132537/a-lesson-from-pokemon/",
        "published": "Mon, 09 Feb 2026 17:02",
        "summary": "This story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first,&#160;sign up here. Lots of influential people in tech last week were describing Moltbook, an online hangout populated by AI agents interacting with one another, as a glimpse into the future. It appeared to show&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Accelerating Mathematical and Scientific Discovery with Gemini Deep Think",
        "link": "https://deepmind.google/blog/accelerating-mathematical-and-scientific-discovery-with-gemini-deep-think/",
        "published": "Mon, 09 Feb 2026 16:12",
        "summary": "Research papers point to the growing impact of Deep Think across fields",
        "source": "DeepMind"
    },
    {
        "title": "Opus 4.6, Codex 5.3, and the post-benchmark era",
        "link": "https://www.interconnects.ai/p/opus-46-vs-codex-53",
        "published": "Mon, 09 Feb 2026 14:03",
        "summary": "On comparing models in 2026.",
        "source": "Interconnects"
    }
]