[
    {
        "title": "Trump’s AI Action Plan is a distraction",
        "link": "https://www.technologyreview.com/2025/07/24/1120639/trumps-ai-action-plan-is-a-distraction/",
        "published": "Thu, 24 Jul 2025 20:15",
        "summary": "On Wednesday, President Trump issued three executive orders, delivered a speech, and released an action plan, all on the topic of continuing American leadership in AI.  The plan contains dozens of proposed actions, grouped into three “pillars”: accelerating innovation, building infrastructure, and leading international diplomacy and security. Some of its recommendations are thoughtful even if&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "America’s AI watchdog is losing its bite",
        "link": "https://www.technologyreview.com/2025/07/24/1120645/americas-ai-watchdog-is-losing-its-bite/",
        "published": "Thu, 24 Jul 2025 18:59",
        "summary": "Most Americans encounter the Federal Trade Commission only if they’ve been scammed: It handles identity theft, fraud, and stolen data. During the Biden administration, the agency went after AI companies for scamming customers with deceptive advertising or harming people by selling irresponsible technologies. With yesterday’s announcement of President Trump’s AI Action Plan, that era may&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The White House's plan for open models & AI research in the U.S.",
        "link": "https://www.interconnects.ai/p/the-white-houses-plan-for-open-models",
        "published": "Wed, 23 Jul 2025 16:09",
        "summary": "Thoughts on the new AI Action plan, American DeepSeek, and what comes next.",
        "source": "Interconnects"
    },
    {
        "title": "America’s AI Action Plan",
        "link": "https://www.hyperdimensional.co/p/americas-ai-action-plan",
        "published": "Wed, 23 Jul 2025 15:07",
        "summary": "A little less conversation, a little more action ",
        "source": "Hyperdimensional"
    },
    {
        "title": "Google DeepMind’s new AI can help historians understand ancient Latin inscriptions",
        "link": "https://www.technologyreview.com/2025/07/23/1120574/deepmind-ai-aeneas-helps-historians-interpret-latin-inscriptions/",
        "published": "Wed, 23 Jul 2025 15:00",
        "summary": "Google DeepMind has unveiled new artificial-intelligence software that could help historians recover the meaning and context behind ancient Latin engravings.&#160; Aeneas can analyze words written in long-weathered stone to say when and where they were originally inscribed. It follows Google’s previous archaeological tool Ithaca, which also used deep learning to reconstruct and contextualize ancient text,&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Aeneas transforms how historians connect the past",
        "link": "https://deepmind.google/discover/blog/aeneas-transforms-how-historians-connect-the-past/",
        "published": "Wed, 23 Jul 2025 14:59",
        "summary": "We’re publishing a paper in Nature introducing Aeneas, the first AI model for contextualizing ancient inscriptions.",
        "source": "DeepMind"
    },
    {
        "title": "Gemini 2.5 Flash-Lite is now ready for scaled production use",
        "link": "https://deepmind.google/discover/blog/gemini-25-flash-lite-is-now-ready-for-scaled-production-use/",
        "published": "Tue, 22 Jul 2025 16:00",
        "summary": "Gemini 2.5 Flash-Lite, previously in preview, is now stable and generally available. This cost-efficient model provides high quality in a small size, and includes 2.5 family features like a 1 million-token context window and multimodality.",
        "source": "DeepMind"
    },
    {
        "title": "Five things you need to know about AI right now",
        "link": "https://www.technologyreview.com/2025/07/22/1120556/five-things-to-know-ai/",
        "published": "Tue, 22 Jul 2025 09:50",
        "summary": "Last month I gave a talk at SXSW London called “Five things you need to know about AI”—my personal picks for the five most important ideas in AI right now.&#160; I aimed the talk at a general audience, and it serves as a quick tour of how I’m thinking about AI in 2025. I’m sharing&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Latest open artifacts (#12): Chinese models continue to dominate throughout the summer 🦦",
        "link": "https://www.interconnects.ai/p/latest-open-artifacts-12-qwen3-235b-a22b-instruct-2507",
        "published": "Tue, 22 Jul 2025 00:02",
        "summary": "A new flagship Qwen model, Qwen3-235B-A22B-Instruct-2507, and a general rise in ecosystem quality in Artifacts Log 12. ",
        "source": "Interconnects"
    },
    {
        "title": "Advanced version of Gemini with Deep Think officially achieves gold-medal standard at the International Mathematical Olympiad",
        "link": "https://deepmind.google/discover/blog/advanced-version-of-gemini-with-deep-think-officially-achieves-gold-medal-standard-at-the-international-mathematical-olympiad/",
        "published": "Mon, 21 Jul 2025 16:30",
        "summary": "Our advanced model officially achieved a gold-medal level performance on problems from the International Mathematical Olympiad (IMO), the world’s most prestigious competition for young mathematicians. It earned a total of 35 points by perfectly solving five out of the six problems.",
        "source": "DeepMind"
    },
    {
        "title": "Exploring the context of online images with Backstory",
        "link": "https://deepmind.google/discover/blog/exploring-the-context-of-online-images-with-backstory/",
        "published": "Mon, 21 Jul 2025 15:00",
        "summary": "New experimental AI tool helps people explore the context and origin of images seen online.",
        "source": "DeepMind"
    },
    {
        "title": "AI companies have stopped warning you that their chatbots aren’t doctors",
        "link": "https://www.technologyreview.com/2025/07/21/1120522/ai-companies-have-stopped-warning-you-that-their-chatbots-arent-doctors/",
        "published": "Mon, 21 Jul 2025 08:45",
        "summary": "AI companies have now mostly abandoned the once-standard practice of including medical disclaimers and warnings in response to health questions, new research has found. In fact, many leading AI models will now not only answer health questions but even ask follow-ups and attempt a diagnosis. Such disclaimers serve an important reminder to people asking AI&#8230;",
        "source": "Technology Review"
    }
]