[
    {
        "title": "Understanding and Implementing Qwen3 From Scratch",
        "link": "https://magazine.sebastianraschka.com/p/qwen3-from-scratch",
        "published": "Sat, 06 Sep 2025 11:10",
        "summary": "A Detailed Look at One of the Leading Open-Source LLMs",
        "source": "Ahead of AI"
    },
    {
        "title": "Coming in for a Landing",
        "link": "https://www.hyperdimensional.co/p/coming-in-for-a-landing",
        "published": "Fri, 05 Sep 2025 12:45",
        "summary": "Remarks at NatCon 2025",
        "source": "Hyperdimensional"
    },
    {
        "title": "Using AI to perceive the universe in greater depth",
        "link": "https://deepmind.google/discover/blog/using-ai-to-perceive-the-universe-in-greater-depth/",
        "published": "Thu, 04 Sep 2025 18:00",
        "summary": "Our novel Deep Loop Shaping method improves control of gravitational wave observatories, helping astronomers better understand the dynamics and formation of the universe.",
        "source": "DeepMind"
    },
    {
        "title": "Imagining the future of banking with agentic AI",
        "link": "https://www.technologyreview.com/2025/09/04/1123023/imagining-the-future-of-banking-with-agentic-ai/",
        "published": "Thu, 04 Sep 2025 16:21",
        "summary": "Agentic AI is coming of age. And with it comes new opportunities in the financial services sector. Banks are increasingly employing agentic AI to optimize processes, navigate complex systems, and sift through vast quantities of unstructured data to make decisions and take actions—with or without human involvement. “With the maturing of agentic AI, it is&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Synthesia’s AI clones are more expressive than ever. Soon they’ll be able to talk back.",
        "link": "https://www.technologyreview.com/2025/09/04/1123054/synthesias-ai-clones-are-more-expressive-than-ever-soon-theyll-be-able-to-talk-back/",
        "published": "Thu, 04 Sep 2025 10:05",
        "summary": "Earlier this summer, I walked through the glassy lobby of a fancy office in London, into an elevator, and then along a corridor into a clean, carpeted room. Natural light flooded in through its windows, and a large pair of umbrella-like lighting rigs made the room even brighter. I tried not to squint as I&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The connected customer",
        "link": "https://www.technologyreview.com/2025/09/03/1121441/the-connected-customer/",
        "published": "Wed, 03 Sep 2025 08:46",
        "summary": "As brands compete for increasingly price conscious consumers, customer experience (CX) has become a decisive differentiator. Yet many struggle to deliver, constrained by outdated systems, fragmented data, and organizational silos that limit both agility and consistency. The current wave of artificial intelligence, particularly agentic AI that can reason and act across workflows, offers a powerful&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Building the AI-enabled enterprise of the future",
        "link": "https://www.technologyreview.com/2025/09/03/1122367/building-the-ai-enabled-enterprise-of-the-future/",
        "published": "Wed, 03 Sep 2025 08:38",
        "summary": "Artificial intelligence is fundamentally reshaping how the world operates. With its potential to automate repetitive tasks, analyze vast datasets, and augment human capabilities, the use of AI technologies is already driving changes across industries. In health care and pharmaceuticals, machine learning and AI-powered tools are advancing disease diagnosis, reducing drug discovery timelines by as much&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "What health care providers actually want from AI",
        "link": "https://www.technologyreview.com/2025/09/02/1122688/what-health-care-providers-actually-want-from-ai/",
        "published": "Tue, 02 Sep 2025 12:00",
        "summary": "In a market flooded with AI promises, health care decision-makers are no longer dazzled by flashy demos or abstract potential. Today, they want pragmatic and pressure-tested products. They want solutions that work for their clinicians, staff, patients, and their bottom line. To gain traction in 2025 and beyond, health care providers are looking for real-world solutions&#8230;",
        "source": "Technology Review"
    }
]