[
    {
        "title": "The AI Patchwork Emerges",
        "link": "https://www.hyperdimensional.co/p/the-ai-patchwork-emerges",
        "published": "Thu, 15 Jan 2026 13:45",
        "summary": "An update on state AI law in 2026 (so far)",
        "source": "Hyperdimensional"
    },
    {
        "title": "Veo 3.1 Ingredients to Video: More consistency, creativity and control",
        "link": "https://deepmind.google/blog/veo-3-1-ingredients-to-video-more-consistency-creativity-and-control/",
        "published": "Tue, 13 Jan 2026 17:00",
        "summary": "Our latest Veo update generates lively, dynamic clips that feel natural and engaging — and supports vertical video generation.",
        "source": "DeepMind"
    },
    {
        "title": "CES showed me why Chinese tech companies feel so optimistic",
        "link": "https://www.technologyreview.com/2026/01/12/1131193/ces-showed-me-why-chinese-tech-companies-feel-so-optimistic/",
        "published": "Mon, 12 Jan 2026 17:01",
        "summary": "This story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first,&#160;sign up here. I decided to go to CES kind of at the last minute. Over the holiday break, contacts from China kept messaging me about their travel plans. After the umpteenth “See you in&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Meet the new biologists treating LLMs like aliens",
        "link": "https://www.technologyreview.com/2026/01/12/1129782/ai-large-language-models-biology-alien-autopsy/",
        "published": "Mon, 12 Jan 2026 11:00",
        "summary": "How large is a large language model? Think about it this way. In the center of San Francisco there’s a hill called Twin Peaks from which you can view nearly the entire city. Picture all of it—every block and intersection, every neighborhood and park, as far as you can see—covered in sheets of paper. Now&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Hyperscale AI data centers: 10 Breakthrough Technologies 2026",
        "link": "https://www.technologyreview.com/2026/01/12/1129982/hyperscale-ai-data-centers-energy-usage-2026-breakthrough-technology/",
        "published": "Mon, 12 Jan 2026 11:00",
        "summary": "In sprawling stretches of farmland and industrial parks, supersized buildings packed with racks of computers are springing up to fuel the AI race. These engineering marvels are a new species of infrastructure: supercomputers designed to train and run large language models at mind-­bending scale, complete with their own specialized chips, cooling systems, and even energy&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Mechanistic interpretability: 10 Breakthrough Technologies 2026",
        "link": "https://www.technologyreview.com/2026/01/12/1130003/mechanistic-interpretability-ai-research-models-2026-breakthrough-technologies/",
        "published": "Mon, 12 Jan 2026 11:00",
        "summary": "Hundreds of millions of people now use chatbots every day. And yet the large language models that drive them are so complicated that nobody really understands what they are, how they work, or exactly what they can and can’t do—not even the people who build them. Weird, right? It’s also a problem. Without a clear&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "AI companions: 10 Breakthrough Technologies 2026",
        "link": "https://www.technologyreview.com/2026/01/12/1130018/ai-companions-chatbots-relationships-2026-breakthrough-technology/",
        "published": "Mon, 12 Jan 2026 11:00",
        "summary": "Chatbots are skilled at crafting sophisticated dialogue and mimicking empathetic behavior. They never get tired of chatting. It’s no wonder, then, that so many people now use them for companionship—forging friendships or even romantic relationships.&#160; According to a study from the nonprofit Common Sense Media, 72% of US teenagers have used AI for companionship. Although&#8230;",
        "source": "Technology Review"
    }
]