[
    {
        "title": "Moltbook was peak AI theater",
        "link": "https://www.technologyreview.com/2026/02/06/1132448/moltbook-was-peak-ai-theater/",
        "published": "Fri, 06 Feb 2026 16:38",
        "summary": "For a few days this week the hottest new hangout on the internet was a vibe-coded Reddit clone called Moltbook, which billed itself as a social network for bots. As the website’s tagline puts it: “Where AI agents share, discuss, and upvote. Humans welcome to observe.” We observed! Launched on January 28 by Matt Schlicht,&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "On Recursive Self-Improvement (Part I)",
        "link": "https://www.hyperdimensional.co/p/on-recursive-self-improvement-part",
        "published": "Thu, 05 Feb 2026 14:51",
        "summary": "Thoughts on the automation of AI research",
        "source": "Hyperdimensional"
    },
    {
        "title": "This is the most misunderstood graph in AI",
        "link": "https://www.technologyreview.com/2026/02/05/1132254/this-is-the-most-misunderstood-graph-in-ai/",
        "published": "Thu, 05 Feb 2026 10:00",
        "summary": "MIT Technology Review Explains: Let our writers untangle the complex, messy world of technology to help you understand what’s coming next. You can read more from the series here. Every time OpenAI, Google, or Anthropic drops a new frontier large language model, the AI community holds its breath. It doesn’t exhale until METR, an AI&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Why Nvidia builds open models with Bryan Catanzaro",
        "link": "https://www.interconnects.ai/p/why-nvidia-builds-open-models-with",
        "published": "Wed, 04 Feb 2026 18:00",
        "summary": "Interconnects interview #17 on the past, present, and future of the Nemotron project.",
        "source": "Interconnects"
    },
    {
        "title": "From guardrails to governance: A CEO’s guide for securing agentic systems",
        "link": "https://www.technologyreview.com/2026/02/04/1131014/from-guardrails-to-governance-a-ceos-guide-for-securing-agentic-systems/",
        "published": "Wed, 04 Feb 2026 14:00",
        "summary": "The previous article in this series, “Rules fail at the prompt, succeed at the boundary,” focused on the first AI-orchestrated espionage campaign and the failure of prompt-level control. This article is the prescription. The question every CEO is now getting from their board is some version of: What do we do about agent risk? Across&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "What we’ve been getting wrong about AI’s truth crisis",
        "link": "https://www.technologyreview.com/2026/02/02/1132068/what-weve-been-getting-wrong-about-ais-truth-crisis/",
        "published": "Mon, 02 Feb 2026 18:09",
        "summary": "This story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first,&#160;sign up here. What would it take to convince you that the era of truth decay we were long warned about—where AI content dupes us, shapes our beliefs even when we catch the lie, and&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The crucial first step for designing a successful enterprise AI system",
        "link": "https://www.technologyreview.com/2026/02/02/1131822/the-crucial-first-step-for-designing-a-successful-enterprise-ai-system/",
        "published": "Mon, 02 Feb 2026 14:20",
        "summary": "Many organizations rushed into generative AI, only to see pilots fail to deliver value. Now, companies want measurable outcomes—but how do you design for success? At Mistral AI, we partner with global industry leaders to co-design tailored AI solutions that solve their most difficult problems. Whether it’s increasing CX productivity with Cisco, building a more&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Latest open artifacts (#18): Arcee's 400B MoE, LiquidAI's underrated 1B model, new Kimi, and anticipation of a busy month",
        "link": "https://www.interconnects.ai/p/latest-open-artifacts-18-arcees-big",
        "published": "Mon, 02 Feb 2026 13:03",
        "summary": "Tons of useful \"niche\" models and anticipation of big releases coming soon.",
        "source": "Interconnects"
    }
]