[
    {
        "title": "Meet the researcher hosting a scientific conference by and for AI",
        "link": "https://www.technologyreview.com/2025/08/22/1122304/ai-scientist-research-autonomous-agents/",
        "published": "Fri, 22 Aug 2025 11:00",
        "summary": "In October, a new academic conference will debut that’s unlike any other. Agents4Science is a one-day online event that will encompass all areas of science, from physics to medicine. All of the work shared will have been researched, written, and reviewed primarily by AI, and will be presented using text-to-speech technology.&#160; The conference is the&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "What's up with the States?",
        "link": "https://www.hyperdimensional.co/p/whats-up-with-the-states",
        "published": "Thu, 21 Aug 2025 12:45",
        "summary": "A check-in ",
        "source": "Hyperdimensional"
    },
    {
        "title": "In a first, Google has released data on how much energy an AI prompt uses",
        "link": "https://www.technologyreview.com/2025/08/21/1122288/google-gemini-ai-energy/",
        "published": "Thu, 21 Aug 2025 12:00",
        "summary": "Google has just released a technical report detailing how much energy its Gemini apps use for each query. In total, the median prompt—one that falls in the middle of the range of energy demand—consumes 0.24 watt-hours of electricity, the equivalent of running a standard microwave for about one second. The company also provided average estimates&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Should AI flatter us, fix us, or just inform us?",
        "link": "https://www.technologyreview.com/2025/08/19/1122021/should-ai-flatter-us-fix-us-or-just-inform-us/",
        "published": "Tue, 19 Aug 2025 09:00",
        "summary": "How do you want your AI to treat you?&#160; It’s a serious question, and it’s one that Sam Altman, OpenAI’s CEO, has clearly been chewing on since GPT-5’s bumpy launch at the start of the month.&#160; He faces a trilemma. Should ChatGPT flatter us, at the risk of fueling delusions that can spiral out of&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Why we should thank pigeons for our AI breakthroughs",
        "link": "https://www.technologyreview.com/2025/08/18/1121370/ai-pigeons-reinforcement-learning/",
        "published": "Mon, 18 Aug 2025 10:00",
        "summary": "In 1943, while the world’s brightest physicists split atoms for the Manhattan Project, the American psychologist B.F. Skinner led his own secret government project to win World War II.&#160; Skinner did not aim to build a new class of larger, more destructive weapons. Rather, he wanted to make conventional bombs more precise. The idea struck&#8230;",
        "source": "Technology Review"
    }
]