[
    {
        "title": "Understanding the 4 Main Approaches to LLM Evaluation (From Scratch)",
        "link": "https://magazine.sebastianraschka.com/p/llm-evaluation-4-approaches",
        "published": "Sun, 05 Oct 2025 11:12",
        "summary": "Multiple-Choice Benchmarks, Verifiers, Leaderboards, and LLM Judges with Code Examples",
        "source": "Ahead of AI"
    },
    {
        "title": "\"Be It Enacted\"",
        "link": "https://www.hyperdimensional.co/p/be-it-enacted",
        "published": "Thu, 02 Oct 2025 15:29",
        "summary": "A Proposal for Federal AI Preemption ",
        "source": "Hyperdimensional"
    },
    {
        "title": "Unlocking AI’s full potential requires operational excellence",
        "link": "https://www.technologyreview.com/2025/10/01/1124593/unlocking-ais-full-potential-requires-operational-excellence/",
        "published": "Wed, 01 Oct 2025 14:00",
        "summary": "Talk of AI is inescapable. It’s often the main topic of discussion at board and executive meetings, at corporate retreats, and in the media. A record 58% of S&#38;P 500 companies mentioned AI in their second-quarter earnings calls, according to Goldman Sachs. But it’s difficult to walk the talk. Just 5% of generative AI pilots&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "OpenAI is huge in India. Its models are steeped in caste bias.",
        "link": "https://www.technologyreview.com/2025/10/01/1124621/openai-india-caste-bias/",
        "published": "Wed, 01 Oct 2025 10:28",
        "summary": "When Dhiraj Singha began applying for postdoctoral sociology fellowships in Bengaluru, India, in March, he wanted to make sure the English in his application was pitch-perfect. So he turned to ChatGPT. He was surprised to see that in addition to smoothing out his language, it changed his identity—swapping out his surname for “Sharma,” which is&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "ChatGPT: The Agentic App",
        "link": "https://www.interconnects.ai/p/the-agentic-app",
        "published": "Tue, 30 Sep 2025 13:03",
        "summary": "ChatGPT's long awaited move into user monetization and what it shows about the future of ChatGPT (and AI products writ large).",
        "source": "Interconnects"
    },
    {
        "title": "The US may be heading toward a drone-filled future",
        "link": "https://www.technologyreview.com/2025/09/30/1124470/the-us-may-be-heading-toward-a-drone-filled-future/",
        "published": "Tue, 30 Sep 2025 09:00",
        "summary": "On Thursday, I published a story about the police-tech giant Flock Safety selling its drones to the private sector to track shoplifters. Keith Kauffman, a former police chief who now leads Flock’s drone efforts, described the ideal scenario: A security team at a Home Depot, say, launches a drone from the roof that follows shoplifting&#8230;",
        "source": "Technology Review"
    }
]