[
    {
        "title": "Google DeepMind’s new AI agent cracks real-world problems better than humans can",
        "link": "https://www.technologyreview.com/2025/05/14/1116438/google-deepminds-new-ai-uses-large-language-models-to-crack-real-world-problems/",
        "published": "Wed, 14 May 2025 15:00",
        "summary": "Google DeepMind has once again used large language models to discover new solutions to long-standing problems in math and computer science. This time the firm has shown that its approach can not only tackle unsolved theoretical puzzles, but improve a range of important real-world processes as well. Google DeepMind&#8217;s new tool, called AlphaEvolve, uses the&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "AlphaEvolve: A Gemini-powered coding agent for designing advanced algorithms",
        "link": "https://deepmind.google/discover/blog/alphaevolve-a-gemini-powered-coding-agent-for-designing-advanced-algorithms/",
        "published": "Wed, 14 May 2025 14:59",
        "summary": "New AI agent evolves algorithms for math and practical applications in computing by combining the creativity of large language models with automated evaluators",
        "source": "DeepMind"
    },
    {
        "title": "My path into AI",
        "link": "https://www.interconnects.ai/p/my-path-into-ai",
        "published": "Wed, 14 May 2025 12:02",
        "summary": "How I got here. Building a career brick by brick over 8 years.",
        "source": "Interconnects"
    },
    {
        "title": "Police tech can sidestep facial recognition bans now",
        "link": "https://www.technologyreview.com/2025/05/13/1116321/police-tech-can-sidestep-facial-recognition-bans-now/",
        "published": "Tue, 13 May 2025 09:00",
        "summary": "Six months ago I attended the largest gathering of chiefs of police in the US to see how they’re using AI. I found some big developments, like officers getting AI to write their police reports. Today, I published a new story that shows just how far AI for police has developed since then.&#160; It’s about&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "How a new type of AI is helping police skirt facial recognition bans",
        "link": "https://www.technologyreview.com/2025/05/12/1116295/how-a-new-type-of-ai-is-helping-police-skirt-facial-recognition-bans/",
        "published": "Mon, 12 May 2025 09:00",
        "summary": "Police and federal agencies have found a controversial new way to skirt the growing patchwork of laws that curb how they use facial recognition: an AI model that can track people using attributes like body size, gender, hair color and style, clothing, and accessories.&#160; The tool, called Track and built by the video analytics company&#8230;",
        "source": "Technology Review"
    }
]