[
    {
        "title": "Sycophancy and the art of the model",
        "link": "https://www.interconnects.ai/p/sycophancy-and-the-art-of-the-model",
        "published": "Sun, 04 May 2025 16:45",
        "summary": "GPT-4o-simp, LMArena backlash, and people refusing to understand how messy and crucial RLHF is.",
        "source": "Interconnects"
    },
    {
        "title": "State of play of AI progress (and related brakes on an intelligence explosion)",
        "link": "https://www.interconnects.ai/p/brakes-on-an-intelligence-explosion",
        "published": "Wed, 30 Apr 2025 12:02",
        "summary": "Why I don't think AI 2027 is going to come true.",
        "source": "Interconnects"
    },
    {
        "title": "This data set helps researchers spot harmful stereotypes in LLMs",
        "link": "https://www.technologyreview.com/2025/04/30/1115946/this-data-set-helps-researchers-spot-harmful-stereotypes-in-llms/",
        "published": "Wed, 30 Apr 2025 09:41",
        "summary": "AI models are riddled with culturally specific biases. A new data set, called SHADES, is designed to help developers combat the problem by spotting harmful stereotypes and other kinds of discrimination that emerge in AI chatbot responses across a wide range of languages. Margaret Mitchell, chief ethics scientist at AI startup Hugging Face, led the&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "The AI Hype Index: AI agent cyberattacks, racing robots, and musical models",
        "link": "https://www.technologyreview.com/2025/04/29/1115918/the-ai-hype-index-ai-agent-cyberattacks-racing-robots-and-musical-models/",
        "published": "Tue, 29 Apr 2025 10:00",
        "summary": "Separating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry. AI agents are the AI industry’s hypiest new product—intelligent assistants capable of completing tasks without human supervision. But while they can be theoretically&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "We need to start thinking of AI as “normal”",
        "link": "https://www.technologyreview.com/2025/04/29/1115928/is-ai-normal/",
        "published": "Tue, 29 Apr 2025 09:00",
        "summary": "Right now, despite its ubiquity, AI is seen as anything but a normal technology. There is talk of AI systems that will soon merit the term “superintelligence,” and the former CEO of Google recently suggested we control AI models the way we control uranium and other nuclear weapons materials. Anthropic is dedicating time and money&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Qwen 3: The new open standard",
        "link": "https://www.interconnects.ai/p/qwen-3-the-new-open-standard",
        "published": "Mon, 28 Apr 2025 23:25",
        "summary": "A wonderful release, base models, reasoners, model size scales, and all before LlamaCon.",
        "source": "Interconnects"
    },
    {
        "title": "Transparency and (shifting) priority stacks",
        "link": "https://www.interconnects.ai/p/transparency-and-shifting-priority",
        "published": "Mon, 28 Apr 2025 12:02",
        "summary": "What you want to be open says a lot about your ranked priorities.",
        "source": "Interconnects"
    }
]