[
    {
        "title": "Gemma 3, OLMo 2 32B, and the growing potential of open-source AI",
        "link": "https://www.interconnects.ai/p/gemma-3-olmo-2-32b-and-the-growing",
        "published": "Thu, 13 Mar 2025 18:16",
        "summary": "Leading open-weight models and the first open-source model to clearly surpass GPT 3.5 (the very last version).",
        "source": "Interconnects"
    },
    {
        "title": "Gemini Robotics uses Google’s top language model to make robots more useful",
        "link": "https://www.technologyreview.com/2025/03/12/1113178/gemini-robotics-uses-googles-top-language-model-to-make-robots-more-useful/",
        "published": "Wed, 12 Mar 2025 15:14",
        "summary": "Google DeepMind has released a new model, Gemini Robotics, that combines its best large language model with robotics. Plugging in the LLM seems to give robots the ability to be more dexterous, work from natural-language commands, and generalize across tasks. All three are things that robots have struggled to do until now. The team hopes&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Gemini Robotics brings AI into the physical world",
        "link": "https://deepmind.google/discover/blog/gemini-robotics-brings-ai-into-the-physical-world/",
        "published": "Wed, 12 Mar 2025 15:00",
        "summary": "Introducing Gemini Robotics and Gemini Robotics-ER, AI models designed for robots to understand, act and react to the physical world.",
        "source": "DeepMind"
    },
    {
        "title": "Experiment with Gemini 2.0 Flash native image generation",
        "link": "https://deepmind.google/discover/blog/experiment-with-gemini-20-flash-native-image-generation/",
        "published": "Wed, 12 Mar 2025 14:58",
        "summary": "Native image output is available in Gemini 2.0 Flash for developers to experiment with in Google AI Studio and the Gemini API.",
        "source": "DeepMind"
    },
    {
        "title": "Interviewing Eugene Vinitsky on self-play for self-driving and what else people do with RL",
        "link": "https://www.interconnects.ai/p/interviewing-eugene-vinitsky-on-self",
        "published": "Wed, 12 Mar 2025 13:03",
        "summary": "#13. Reinforcement learning fundamentals and scaling.",
        "source": "Interconnects"
    },
    {
        "title": "Introducing Gemma 3",
        "link": "https://deepmind.google/discover/blog/introducing-gemma-3/",
        "published": "Wed, 12 Mar 2025 08:00",
        "summary": "The most capable model you can run on a single GPU or TPU.",
        "source": "DeepMind"
    },
    {
        "title": "Everyone in AI is talking about Manus. We put it to the test.",
        "link": "https://www.technologyreview.com/2025/03/11/1113133/manus-ai-review/",
        "published": "Tue, 11 Mar 2025 22:21",
        "summary": "Since the general AI agent Manus was launched last week, it has spread online like wildfire. And not just in China, where it was developed by the Wuhan-based startup Butterfly Effect. It’s made&#160; its way into the global conversation, with influential voices in tech, including Twitter cofounder Jack Dorsey and Hugging Face product lead Victor&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Waabi says its virtual robotrucks are realistic enough to prove the real ones are safe",
        "link": "https://www.technologyreview.com/2025/03/11/1113044/waabi-says-its-virtual-robotrucks-are-realistic-enough-to-prove-the-real-ones-are-safe/",
        "published": "Tue, 11 Mar 2025 13:00",
        "summary": "The Canadian robotruck startup Waabi says its super-realistic virtual simulation is now accurate enough to prove the safety of its driverless big rigs without having to run them for miles on real roads.  The company uses a digital twin of its real-world robotruck, loaded up with real sensor data, and measures how the twin’s performance&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Why Manus Matters",
        "link": "https://www.hyperdimensional.co/p/why-manus-matters",
        "published": "Tue, 11 Mar 2025 12:35",
        "summary": "The American AI Diffusion Challenge",
        "source": "Hyperdimensional"
    },
    {
        "title": "AGI is suddenly a dinner table topic",
        "link": "https://www.technologyreview.com/2025/03/11/1112983/agi-is-suddenly-a-dinner-table-topic/",
        "published": "Tue, 11 Mar 2025 09:00",
        "summary": "This story originally appeared in The Algorithm, our weekly newsletter on AI. To get stories like this in your inbox first, sign up here. The concept of artificial general intelligence—an ultra-powerful AI system we don’t have yet—can be thought of as a balloon, repeatedly inflated with hype during peaks of optimism (or fear) about its potential&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "These new AI benchmarks could help make models less biased",
        "link": "https://www.technologyreview.com/2025/03/11/1113000/these-new-ai-benchmarks-could-help-make-models-less-biased/",
        "published": "Tue, 11 Mar 2025 08:00",
        "summary": "New AI benchmarks could help developers reduce bias in AI models, potentially making them fairer and less likely to cause harm. The research, from a team based at Stanford, was posted to the arXiv preprint server in early February. The researchers were inspired to look into the problem of bias after witnessing clumsy missteps in&#8230;",
        "source": "Technology Review"
    },
    {
        "title": "Elicitation, the simplest way to understand post-training",
        "link": "https://www.interconnects.ai/p/elicitation-theory-of-post-training",
        "published": "Mon, 10 Mar 2025 16:34",
        "summary": "An F1 analogy to help understand fast improvements in post-training on top of slow improvements in scaling.",
        "source": "Interconnects"
    }
]